Repository: DaiYu-233/YMCL.Avalonia
Catalog: YMCL.Main/YMCL/Public/Langs/MainLang.*.resx
Languages: ja_jp, ru_ru, zh_hant

# Launch
source: 启动
ja_jp: 起動
ru_ru: Активировать
zh_hant: 啟動

# MinecraftFolder
source: Minecraft文件夹
ja_jp: Minecraft フォルダ
ru_ru: Папка Minecraft
zh_hant: Minecraft資料夾

# DelSelectedItem
source: 删除选中项
ja_jp: 選択項目を削除
ru_ru: Удалить выбранное
zh_hant: 刪除選取項目

# AddFolder
source: 添加文件夹
ja_jp: フォルダを追加
ru_ru: Добавить папку
zh_hant: 新增資料夾

# SelectMinecraftFolder
source: 选择'.minecraft'文件夹
ja_jp: ターゲットフォルダを選択 '.minecraft'フォルダ'
ru_ru: Выберите папку'.minecraft'
zh_hant: 選擇'.minecraft'資料夾

# NeedToSelectMinecraftFolder
source: 需选择'.minecraft'文件夹
ja_jp: ターゲットフォルダは「.minecraft'」フォルダを選択する必要があります
ru_ru: Необходимо выбрать папку'.minecraft'
zh_hant: 需選擇'.minecraft'資料夾

# SuccessAdd
source: 添加成功
ja_jp: 追加終了
ru_ru: Успешно добавлено

# TheItemAlreadyExist
source: 已存在此项目
ja_jp: このプロジェクトはすでに存在します
ru_ru: Этот элемент уже существует
zh_hant: 已存在此項目

# SuccessRemove
source: 移除成功
ja_jp: 削除成功
ru_ru: Удаление выполнено успешно
zh_hant: 刪除成功

# AutoScan
source: 自动扫描
ja_jp: 自動スキャン
ru_ru: Автоматическое сканирование
zh_hant: 自動掃描

# LetYMCLChooseJava
source: 让YMCL选择合适的Java
ja_jp: YMCLでのカスタム値 Java を利用する
ru_ru: Пусть YMCL выберет правильную Java
zh_hant: 讓YMCL選擇合適的Java

# ScanJavaSuccess
source: 扫描Java成功
ja_jp: Javaのスキャンが完了しました
ru_ru: Сканирование Java выполнено успешно
zh_hant: 掃描Java成功

# RepeatItem
source: 重复的项目
ja_jp: プロジェクトの複製
ru_ru: Дублировать элемент
zh_hant: 重複的項目

# OpenFileWay
source: 打开文件方式
ja_jp: ファイルを開く
ru_ru: Как открыть файл
zh_hant: 開啟檔案方式

# FileSelectWindow
source: 文件选择窗口
ja_jp: ファイル選択ウィンドウ
ru_ru: Окно выбора файла
zh_hant: 文件選擇視窗

# ManualInput
source: 手动输入
ja_jp: 手入力
ru_ru: Введите вручную
zh_hant: 手動輸入

# Ok
source: 确定
ja_jp: はい
ru_ru: Подтвердить
zh_hant: 確定

# Cancel
source: 取消
ja_jp: キャンセル
ru_ru: Отмена

# InputFolderPath
source: 输入文件夹路径
ja_jp: フォルダパスを入力
ru_ru: Введите путь к папке
zh_hant: 輸入資料夾路徑

# FolderNotExist
source: 文件夹不存在
ja_jp: フォルダーが存在しません
ru_ru: Каталог не существует
zh_hant: 資料夾不存在

# InputFilePath
source: 输入文件路径
ja_jp: ファイルパスを入力
ru_ru: Введите путь к файлу
zh_hant: 輸入檔路徑

# FileNotExist
source: 文件不存在
ja_jp: ファイルが存在しません
ru_ru: Файл не существует
zh_hant: 檔不存在

# ManualAdd
source: 手动添加
ja_jp: 手動で追加
ru_ru: Добавить вручную
zh_hant: 手動添加

# SelectJava
source: 选择Java
ja_jp: Java の選択
ru_ru: Выбирайте Java
zh_hant: 選擇Java

# TheJavaIsError
source: Java不正确
ja_jp: Javaが正しくない
ru_ru: Java неверна
zh_hant: Java不正確

# AddNewAccount
source: 添加新账户
ja_jp: 新規アカウントを追加
ru_ru: Добавить новую учетную запись
zh_hant: 新增帳戶

# OfflineLogin
source: 离线登录
ja_jp: オフラインでログイン
ru_ru: Войти в автономном режиме
zh_hant: 離線登入

# MicrosoftLogin
source: 微软登录
ja_jp: マイクロソフト ログイン
ru_ru: Microsoft Login
zh_hant: 微軟登入

# ThirdPartyLogin
source: 第三方登录
ja_jp: サードパーティーログイン
ru_ru: Сторонний вход
zh_hant: 第三方登入

# SelectAccountType
source: 选择账户类型
ja_jp: アカウントの種類を選択
ru_ru: Выберите тип счета
zh_hant: 選擇帳戶類型

# AccountNameCannotBeNull
source: 账户名称不可为空
ja_jp: アカウント名が空白にはできません
ru_ru: Имя учетной записи не может быть пустым
zh_hant: 帳戶名稱不可為空白

# InputAccountName
source: 输入账户名称
ja_jp: アカウント名を入力
ru_ru: Введите имя учетной записи
zh_hant: 輸入帳戶名稱

# VerificationCode
source: 验证代码
ja_jp: 認証コード
ru_ru: Проверьте код
zh_hant: 驗證程式碼

# Loading
source: 加载中...
ja_jp: 読み込んでいます...
ru_ru: Загрузка...
zh_hant: 載入中...

# CopyCodeAndOPenBrowser
source: 复制代码并打开浏览器
ja_jp: コードをコピーしてブラウザを開く
ru_ru: Скопируйте код и откройте браузер
zh_hant: 複製程式碼並開啟瀏覽器

# WaitForMicrosoftVerification
source: 正在等待微软账户验证完成 跳转至浏览器完成验证
ja_jp: Microsoftアカウントの認証が完了するのを待っています ブラウザに移動して認証を完了してください
ru_ru: Ожидание подтверждения учетной записи Майкрософт Перейдите в браузер, чтобы завершить проверку
zh_hant: 正在等待微軟帳戶驗證完成 跳轉至瀏覽器完成驗證

# LoginFail
source: 登录失败
ja_jp: ログインに失敗しました
ru_ru: Ошибка входа в систему
zh_hant: 登入失敗

# VerifyingAccount
source: 正在验证账户
ja_jp: アカウントを確認中
ru_ru: Подтверждение аккаунта
zh_hant: 正在驗證帳戶

# VerificationServer
source: 验证服务器
ja_jp: サーバーを確認
ru_ru: Сервер аутентификации
zh_hant: 驗證伺服器

# EmailAddress
source: 邮箱地址
ja_jp: メールアドレス
ru_ru: Адрес электронной почт
zh_hant: 信箱地址

# AccountPassword
source: 账户密码
ja_jp: アカウントパスワード
ru_ru: Пароль учетной записи
zh_hant: 帳戶密碼

# YggdrasilServerUrlIsEmpty
source: 验证服务器不可为空
ja_jp: 確認サーバーは空欄にできません
ru_ru: Сервер верификации не может быть пустым
zh_hant: 驗證伺服器不可為空

# YggdrasilPasswordIsEmpty
source: 密码不可为空
ja_jp: パスワードを空白にすることはできません
ru_ru: Пароль не может быть пустым
zh_hant: 密碼不可為空

# YggdrasilEmailIsEmpty
source: 邮箱不可为空
ja_jp: メールボックスは空欄にできません
ru_ru: Адрес электронной почты не может быть пустым
zh_hant: 信箱不可為空

# Language
source: 语言
ja_jp: 言語
ru_ru: Язык
zh_hant: 語言

# ColorMode
source: 色彩模式
ja_jp: カラーモード
ru_ru: Цветовой режим

# FollowSystem
source: 跟随系统
ja_jp: システムに従う
ru_ru: Следите за системой
zh_hant: 跟隨系統

# Light
source: 浅色
ja_jp: ライト
ru_ru: Светлый
zh_hant: 淺色

# Dark
source: 深色
ja_jp: ダーク
ru_ru: Темный

# MaxMem
source: 最大内存
ja_jp: 最大メモリ
ru_ru: Максимальный объем памяти
zh_hant: 最大記憶體

# CannotOpenBrowser
source: 无法打开浏览器
ja_jp: ブラウザを開くことができませんでした
ru_ru: Не удалось открыть браузер
zh_hant: 無法開啟瀏覽器

# ManualOpen
source: 手动打开
ja_jp: 手動で開く
ru_ru: Открыть вручную
zh_hant: 手動打開

# CopyUrlAndManualOpen
source: Ctrl + C 复制以下链接并粘贴至浏览器
ja_jp: Ctrl + C は次のリンクをコピーしブラウザーに貼り付けてください
ru_ru: Ctrl + C Скопируйте и вставьте следующую ссылку в браузер
zh_hant: Ctrl + C 複製以下連結並貼上到瀏覽器

# VersionList
source: 版本列表
ja_jp: リリース一覧
ru_ru: Список версий
zh_hant: 版本清單

# VersionSetting
source: 版本设置
ja_jp: バージョン設定
ru_ru: Настройки версии
zh_hant: 版本設定

# LaunchGame
source: 启动游戏
ja_jp: ロード
ru_ru: Запустите игру
zh_hant: 啟動遊戲

# NoChooseGame
source: 未选择游戏
ja_jp: ゲームが選択されていません
ru_ru: Игра не выбрана
zh_hant: 未選擇遊戲

# ReturnWithIcon
source: ← 返回
ja_jp: ← 戻す
ru_ru: ← Назад

# CreateGameEntryFail
source: 创建游戏实例失败
ja_jp: ゲームインスタンスの作成に失敗しました
ru_ru: Не удалось создать экземпляр игры
zh_hant: 創建遊戲實例失敗

# NoChooseGameOrCannotFindGame
source: 未选择游戏或无法找到游戏
ja_jp: ゲームが選択されていないか、ゲームが見つかりませんでした
ru_ru: Игра не выбрана или не может быть найдена
zh_hant: 未選擇遊戲或無法找到遊戲

# AccountError
source: 账户错误
ja_jp: アカウントエラー
ru_ru: Ошибка аккаунта
zh_hant: 帳戶錯誤

# LaunchProgress
source: 启动进度
ja_jp: プログレスを起動
ru_ru: Прогресс запуска
zh_hant: 啟動進度

# BuildLaunchConfigFail
source: 构建启动配置失败
ja_jp: 構成のビルド開始に失敗しました
ru_ru: Не удалось создать конфигурацию запуска
zh_hant: 建置啟動配置失敗

# GameExited
source: 游戏已退出
ja_jp: ゲームが終了しました
ru_ru: Игра завершена
zh_hant: 遊戲已退出

# WaitForGameWindowAppear
source: 等待游戏窗口出现
ja_jp: ゲームウィンドウ接近を待機中
ru_ru: Дождитесь появления игрового окна
zh_hant: 等待遊戲視窗出現

# LaunchFinish
source: 启动完成
ja_jp: 開始終了
ru_ru: Запуск завершен
zh_hant: 啟動完成

# LaunchFail
source: 启动失败
ja_jp: 起動に失敗しました
ru_ru: удаление% 1 завершилось неудачно
zh_hant: 啟動失敗

# UserDataFolder
source: 用户数据文件夹
ja_jp: ユーザー データ フォルダ
ru_ru: Папка данных пользователя
zh_hant: 使用者資料夾

# OpenFolder
source: 打开文件夹
ja_jp: フォルダを開く
ru_ru: Открыть папку
zh_hant: 打開資料夾

# AutoInstall
source: 自动安装
ja_jp: 自動インストール
ru_ru: Автоматическая установка
zh_hant: 自動安裝

# LatestVersion
source: 最新版本
ja_jp: 最新バージョン
ru_ru: Последняя версия

# PreviewVersion
source: 预览版本
ja_jp: バージョンをプレビュー
ru_ru: Предварительная версия
zh_hant: 預覽版本

# ReleaseVersion
source: 正式版本
ja_jp: リリースチャンネル
ru_ru: Официальный релиз

# GetInstallableVersionFail
source: 获取可安装列表失败
ja_jp: インストールできるリストの取得に失敗しました
ru_ru: Не удалось получить список для установки
zh_hant: 取得可安裝清單失敗

# OldVersion
source: 远古版本
ja_jp: 古いバージョン
ru_ru: Древняя версия
zh_hant: 遠古版

# AllVersion
source: 所有版本
ja_jp: 全てのバージョン
ru_ru: Все версии

# SearchKeyword
source: 搜索关键词...
ja_jp: 検索キーワード...
ru_ru: Поиск по ключевым словам...
zh_hant: 搜尋關鍵字...

# InstallPreview
source: 安装预览
ja_jp: インストールのプレビュー
ru_ru: Установите предварительный просмотр
zh_hant: 安裝預覽

# NoAdditionalInstall
source: 无附加安装
ja_jp: 空のインストール
ru_ru: Никакой дополнительной установки
zh_hant: 無附加安裝

# BeginInstall
source: 开始安装
ja_jp: インストールの開始
ru_ru: Начать установку
zh_hant: 開始安裝

# ViewUpdatedContent
source: 查看更新内容
ja_jp: 更新を見る
ru_ru: Посмотрите, что нового
zh_hant: 查看更新內容

# Reload
source: 重新加载
ja_jp: 再読み込み
ru_ru: Перезагрузить
zh_hant: 重新加載

# GetFail
source: 获取失败
ja_jp: フェッチに失敗しました
ru_ru: Не удалось получить
zh_hant: 取得失敗

# NoAvailableItem
source: 无可用项目
ja_jp: 利用可能なプロジェクトがありません
ru_ru: Нет доступных товаров
zh_hant: 無可用項目

# MineratCrashed
source: Minecrat发生崩溃
ja_jp: Minecratrでクラッシュしました
ru_ru: Минекрат разбился
zh_hant: Minecrat發生崩潰

# TheVersionNameWillBeRenamedTo
source: 版本名称将被重命名为:
ja_jp: バージョン名が変更されます:
ru_ru: Название версии будет переименовано в:
zh_hant: 版本名稱將被重新命名為:

# IncludeSpecialWord
source: 包含特殊字符
ja_jp: 特殊文字が含まれています
ru_ru: Содержит специальных персонажей
zh_hant: 包含特殊字元

# FolderAlreadyExists
source: 文件夹已存在
ja_jp: フォルダは既に存在します
ru_ru: Папка уже существует
zh_hant: 資料夾已存在

# InstallFail
source: 安装失败
ja_jp: インストールに失敗しました
ru_ru: Ошибка установки
zh_hant: 安裝失敗

# Install
source: 安装
ja_jp: インストール
ru_ru: Установка
zh_hant: 安裝

# InstallFinish
source: 安装完成
ja_jp: インストール完了
ru_ru: Установка завершена
zh_hant: 安裝完成

# CannotFandRightJava
source: 无法找到合适Java
ja_jp: 該当するJavaは見つかりませんでした
ru_ru: Не удалось найти нужную Java
zh_hant: 無法找到合適Java

# Refresh
source: 刷新
ja_jp: 更新
ru_ru: Обновить

# Mod
source: 模组
ja_jp: モジュール
ru_ru: Моды
zh_hant: 模組

# Overview
source: 概览
ja_jp: 概要
ru_ru: Обзор
zh_hant: 概述

# Setting
source: 设置
ja_jp: 設定
ru_ru: Настройки
zh_hant: 設置

# SavesFolder
source: 存档文件夹
ja_jp: アーカイブフォルダ
ru_ru: Архивировать папку
zh_hant: 存檔資料夾

# ModsFolder
source: 模组文件夹
ja_jp: MODフォルダー
ru_ru: Папка модуля
zh_hant: 模組資料夾

# ResourcePacksFolder
source: 资源包文件夹
ja_jp: リソース パック フォルダ
ru_ru: Папка пакета ресурсов
zh_hant: 資源包資料夾

# ShaderPacksFolder
source: 光影包文件夹
ja_jp: 影パッケージフォルダ
ru_ru: Папка Light Pack
zh_hant: 光影包資料夾

# VersionFolder
source: 版本文件夹
ja_jp: バージョンフォルダ
ru_ru: Папка версий
zh_hant: 版本資料夾

# EnableIndependencyCore
source: 启用独立核心
ja_jp: スタンドアロンコアを有効化
ru_ru: Включите автономные ядра
zh_hant: 啟用獨立核心

# UseGlobalSetting
source: 使用全局设置
ja_jp: グローバル設定を使用
ru_ru: Использовать общие настройки
zh_hant: 使用全域設定

# Off
source: 关闭
ja_jp: 閉じる
ru_ru: закрыть
zh_hant: 關閉

# On
source: 开启
ja_jp: オン
ru_ru: включать
zh_hant: 開啟

# AutoJoinServer
source: 自动加入服务器
ja_jp: サーバーを自動登録
ru_ru: Автоматически присоединяться к серверу
zh_hant: 自動加入伺服器

# EnableSelect
source: 启用选中项
ja_jp: 選択を有効
ru_ru: Включить Проверено
zh_hant: 啟用選取項目

# DisableSelect
source: 禁用选中项
ja_jp: 選択項目の無効化
ru_ru: Отключить выбранное
zh_hant: 停用選取項目

# DeleteSelect
source: 删除选中项
ja_jp: 選択項目を削除
ru_ru: Удалить выбранное
zh_hant: 刪除選取項目

# SelectAll
source: 全选
ja_jp: すべて選択
ru_ru: Выбрать всё
zh_hant: 全選

# DeselectAll
source: 全不选
ja_jp: 選択を解除
ru_ru: Не выбирайте ни одного
zh_hant: 全不選

# SelectedItem
source: 已选择项目:
ja_jp: 選択された項目:
ru_ru: Выбранные элементы:
zh_hant: 已選擇項目:

# MoveToRecycleBin
source: 移动到回收站
ja_jp: ゴミ箱に移動
ru_ru: Переместить в корзину
zh_hant: 移動到回收站

# WindowTitleBarStyle
source: 窗口标题栏样式
ja_jp: ウインドウのタイトルバーのスタイル
ru_ru: Стиль строки заголовка окна
zh_hant: 視窗標題欄樣式

# GetException
source: 发生异常
ja_jp: 例外が発生しました
ru_ru: Что-то пошло не так
zh_hant: 發生異常

# UnhandledException
source: 未处理的异常
ja_jp: 未処理例外
ru_ru: Необработанное исключение
zh_hant: 未處理的異常

# CustomHomePage
source: 自定义主页面
ja_jp: メインページ
ru_ru: Настройте главную страницу
zh_hant: 自訂主頁面

# LocalSourceCode
source: 本地源代码
ja_jp: ローカルソースコード
ru_ru: Локальный исходный код
zh_hant: 本地原始碼

# Edit
source: 编辑
ja_jp: 編集
ru_ru: Редактировать
zh_hant: 編輯

# CustomHomePageSourceCodeError
source: 自定义主页面源代码错误
ja_jp: メインページのソースの編集エラー
ru_ru: Ошибка исходного кода пользовательской главной страницы
zh_hant: 自訂主頁面原始碼錯誤

# CheckUpdate
source: 检查更新
ja_jp: 更新を確認
ru_ru: Проверить обновления
zh_hant: 檢查更新

# ChooseArchitecture
source: 选择平台
ja_jp: プラットフォームを選ぶ
ru_ru: Выберите площадку
zh_hant: 選擇平台

# CheckUpdateFail
source: 检查更新失败
ja_jp: 更新のチェックに失敗しました
ru_ru: Не удалось проверить наличие обновлений
zh_hant: 檢查更新失敗

# FoundNewVersion
source: 发现新版本
ja_jp: 新しいバージョンが利用可能
ru_ru: Откройте для себя новые версии
zh_hant: 發現新版本

# GetUpdateUrl
source: 获取更新统一资源定位器
ja_jp: 統一リソースの位置を更新
ru_ru: Получите обновленный унифицированный локатор ресурсов
zh_hant: 取得更新統一資源定位器

# BeginDownload
source: 开始下载
ja_jp: ダウンロードを開始中
ru_ru: Начать загрузку
zh_hant: 開始下載

# UpdateFail
source: 更新失败
ja_jp: 更新に失敗しました
ru_ru: Ошибка обновления
zh_hant: 更新失敗

# ThisArchitectureCannotAutoUpdate
source: 此平台不支持自动更新，打开以下路径手动替换
ja_jp: このプラットフォームは自動的に更新されません。次のパスを手動で置き換えてください
ru_ru: Эта платформа не поддерживает автоматические обновления, откройте следующий путь, чтобы заменить ее вручную
zh_hant: 此平台不支援自動更新，開啟以下路徑手動替換

# Update
source: 更新
ja_jp: アップデート
ru_ru: Обновить

# DownloadFinish
source: 下载完成
ja_jp: ダウンロード完了
ru_ru: Загрузка завершена
zh_hant: 下載完成

# CurrentlyTheLatestVersion
source: 当前是最新版本
ja_jp: お使いのバージョンは最新です
ru_ru: Текущая версия обновлена
zh_hant: 目前是最新版本

# OpenSourceProjectUsageTable
source: 开源项目使用表
ja_jp: オープンソースプロジェクト用テーブル
ru_ru: Лист использования проекта с открытым исходным кодом
zh_hant: 開源項目使用表

# GPL3Text
source: YMCL 以 GPL 3.0 License 协议开放源代码，可以修改且分发，但软件必须包含原始代码的版权声明和许可声明，以及一个包含许可信息的通知文件。
ja_jp: YMCLは GPL 3.0 License プロトコルのソースコードとしてオープンソース化できますが、ライセンスキーの登録およびライセンス規約を含める必要があります。また、ライセンス情報含む通知ファイルが必要です。
ru_ru: Лицензия YMCL является открытым исходным кодом по лицензии GPL 3.0 и может быть изменена и распространена, но программное обеспечение должно содержать уведомления об авторских правах и лицензиях для исходного кода, а также файл уведомлений, содержащий информацию о лицензии.
zh_hant: YMCL 以GPL-3.0 協議開放原始碼，可以修改且分發，但不得刪除原作品的標記，修改後的作品必須也採用GPL 協定進行開源。

# ShowGameOutput
source: 显示游戏输出
ja_jp: ゲームエクスポートを表示
ru_ru: Показать результат игры
zh_hant: 顯示遊戲輸出

# Search
source: 搜索
ja_jp: 検索
ru_ru: поиск
zh_hant: 搜尋

# LoadMore
source: 加载更多
ja_jp: もっと表示
ru_ru: Загрузи больше
zh_hant: 載入更多

# ErrorCallingApi
source: 调用Api时出错
ja_jp: API 呼び出し時にエラー
ru_ru: Ошибка при вызове Api
zh_hant: 呼叫Api時發生錯誤

# SearchNoResult
source: 搜索无结果
ja_jp: 結果が見つかりませんでした
ru_ru: Нет результатов для поиска
zh_hant: 搜尋無結果

# AddLocalSong
source: 添加音频文件
ja_jp: 音声ファイルを追加
ru_ru: Добавьте аудиофайлы
zh_hant: 新增音訊檔案

# SelectMusicFile
source: 选择音频文件
ja_jp: オーディオファイルを選択してください
ru_ru: Выберите аудиофайл
zh_hant: 選擇音訊檔案

# ThemeColor
source: 主题色
ja_jp: アクセント色
ru_ru: Цвет темы
zh_hant: 主題色

# InitAudioLibraryFail
source: 初始化音频库失败
ja_jp: オーディオライブラリの初期化に失敗しました
ru_ru: Не удалось инициализировать аудио библиотеку
zh_hant: 初始化音訊庫失敗

# InstallVlcTip
source: 尝试执行: sudo apt install libvlc-dev sudo apt install vlc
ja_jp: 実行を試みます： sudo apt install libvlc - dev sudo apt install vlc
ru_ru: Попытка выполнения: sudo apt install libvlc-dev sudo apt install vlc
zh_hant: 嘗試執行: sudo apt install libvlc-dev sudo apt install vlc

# ThisFeatureIsCurrentlyUnderDevelopment
source: 此功能正在开发中
ja_jp: この機能は現在開発中です
ru_ru: Эта функция находится в разработке
zh_hant: 此功能正在開發中

# TreasureBox
source: 百宝箱
ja_jp: 百箱
ru_ru: Сундук с сокровищами
zh_hant: 百寶箱

# ActivateWinOffice
source: 激活Windows/Office
ja_jp: Windows/Office の利用
ru_ru: Активируйте Windows/Office

# Run
source: 运行
ja_jp: 実行
ru_ru: Работа
zh_hant: 運行

# ThisFeatureOnlySupportsWindowsPlatform
source: 该功能仅支持Windows平台
ja_jp: この機能はWindowsプラットフォームでのみサポートされています
ru_ru: Эта функция доступна только в Windows
zh_hant: 此功能僅支援Windows平台

# RunCommandFail
source: 运行命令失败
ja_jp: コマンドを実行できません
ru_ru: Не удалось запустить команду
zh_hant: 運行命令失敗

# RunActivate
source: 运行激活
ja_jp: アクティベート
ru_ru: Запустите активацию
zh_hant: 運行激活

# CancelActivateWin
source: 取消激活Windows
ja_jp: Windows の有効化をキャンセル
ru_ru: Деактивируйте Windows

# CancelActivateWinTip
source: 此操作会移除Windows激活状态，导致Windows个性化等功能不可用，是否继续？
ja_jp: Windowsの有効化状態を削除し、Windows パーソナライゼーション機能では使用できません。続行しますか?
ru_ru: Это действие удалит состояние активации Windows, сделав недоступными такие функции, как персонализация Windows. Продолжить?
zh_hant: 此操作會移除Windows啟動狀態，導致Windows個人化等功能無法使用，是否繼續？

# ThisFeatureOnlySupportsWindows10AndAbove
source: 该功能仅支持Windows10以上，低于此版本系统不保证激活成功
ja_jp: この機能はWindows10以降でのみサポートされています。最新のバージョンでは有効にする必要があります
ru_ru: Эта функция поддерживает только Windows 10 и выше, и системы ниже этой версии не гарантируют успешной активации
zh_hant: 此功能僅支援Windows10以上，低於此版本系統不保證啟動成功

# PlayList
source: 播放列表
ja_jp: プレイリスト
ru_ru: Воспроизвести список
zh_hant: 播放清單

# ModName
source: 模组名称
ja_jp: MOD名
ru_ru: Название модуля
zh_hant: 模組名稱

# GameVersion
source: 游戏版本
ja_jp: ゲームバージョン
ru_ru: Версия игры
zh_hant: 遊戲版本

# AnyModLoader
source: 任意加载器
ja_jp: 任意のローダー
ru_ru: Любой погрузчик
zh_hant: 任意載入器

# AnySource
source: 所有来源
ja_jp: すべてのソース
ru_ru: Все источники
zh_hant: 所有來源

# Download
source: 下载
ja_jp: ダウンロード
ru_ru: Загрузить
zh_hant: 下載

# SaveFile
source: 保存文件
ja_jp: ファイルを保存
ru_ru: Сохранить
zh_hant: 保存檔案

# DownloadFail
source: 下载失败
ja_jp: ダウンロードに失敗しました
ru_ru: Загрузка не удалась
zh_hant: 下載失敗

# MatchingVersion
source: 匹配的版本
ja_jp: 一致するバージョン
ru_ru: Соответствующая версия

# ModifyMicrosoftSkin
source: 修改皮肤(微软)
ja_jp: スキン変更 (Microsoft)
ru_ru: Microsoft
zh_hant: 修改皮膚(微軟)

# SkinModel
source: 皮肤模型
ja_jp: 皮膚モデル
ru_ru: Модель кожи
zh_hant: 皮膚模型

# InputSkinFilePath
source: 输入皮肤文件路径
ja_jp: スキンファイルパスを入力
ru_ru: Введите путь к файлу скина
zh_hant: 輸入皮膚檔路徑

# SelectSkinFile
source: 选择皮肤文件
ja_jp: スキンファイルを選択
ru_ru: Выберите файл скина
zh_hant: 選擇皮膚檔案

# RefreshMicrosoftSkin
source: 刷新皮肤
ja_jp: ウィンドウを更新 (Microsoft)
ru_ru: Microsoft
zh_hant: 刷新皮膚(微軟)

# ModifySuccess
source: 修改成功
ja_jp: 修正終了
ru_ru: Модификация прошла успешно

# ModifyFail
source: 修改失败
ja_jp: 更新に失敗しました
ru_ru: Ошибка изменения
zh_hant: 修改失敗

# IfInstallBedRock
source: 如未安装基岩版则无法启动
ja_jp: Blect がインストールされていない場合は起動できません
ru_ru: Если версия коренной породы не установлена, она не запустится
zh_hant: 如未安裝基岩版則無法啟動

# BedRockVersion
source: 基岩版
ja_jp: BE版 バージョン
ru_ru: Bedrock Edition

# CannotOpenBedRockSetting
source: 无法打开基岩版设置
ja_jp: ベースロック設定を開けませんでした
ru_ru: Не удалось открыть настройки коренной породы
zh_hant: 無法打開基岩版設定

# UpgradeToAdministratorPrivileges
source: 提升至管理员权限
ja_jp: 管理者の権限を上げる
ru_ru: Обновите до прав администратора
zh_hant: 提升至管理員權限

# UpgradeToAdministratorPrivilegesFail
source: 提升至管理员权限失败
ja_jp: 管理者への昇格が失敗しました
ru_ru: Не удалось обновить права администратора
zh_hant: 提升至管理員權限失敗

# UpgradeToAdministratorPrivilegesTip
source: 执行操作需要提升至管理员权限，点击确定以管理员权限重启程序
ja_jp: 操作を実行するために管理者権限が必要です。OKを押すとアプリケーションを再起動します
ru_ru: Для выполнения операции необходимо обновить права администратора. Нажмите кнопку ОК, чтобы перезапустить программу с правами администратора
zh_hant: 執行操作需要提升至管理員權限，點選確定以管理員權限重新啟動程式

# ChooseLanguage
source: 选择语言/Choose Language
ja_jp: 言語/Choose Language を選択してください

# ReleaseTheMouseAndLetYmclProcessThisFile
source: 释放鼠标让YMCL处理此文件
ja_jp: YMCLを使用してこのファイルを処理するマウス
ru_ru: Отпустите мышь, чтобы YMCL обработал этот файл
zh_hant: 釋放滑鼠讓YMCL處理此檔案

# UnableToAddModsForBedrockEdition
source: 无法为基岩版添加模组
ja_jp: Modを作成できませんでした
ru_ru: Модули не могут быть добавлены в Bedrock Edition
zh_hant: 無法為基岩版添加模組

# AddTheFollowingFilesAsModsToTheCurrentVersion
source: 将以下文件作为模组添加至当前版本
ja_jp: 以下のファイルをMODとして追加
ru_ru: Добавьте следующие файлы в качестве модуля в текущую версию
zh_hant: 將以下文件作為模組新增至目前版本

# UnsupportedFileType
source: 不支持的文件类型
ja_jp: 対応していないファイルタイプです
ru_ru: Неподдерживаемый тип файла
zh_hant: 不支援的文件類型

# InstallTheFollowingFilesAsAnIntegrationPackageCurseforgeFormat
source: 将以下文件作为整合包(CurseForge格式)安装
ja_jp: 以下のファイルを統合パッケージ（ CurseForge形式）としてインストールしてください
ru_ru: Установите следующие файлы в качестве пакета интеграции (формат CurseForge)
zh_hant: 將下列檔案作為整合包(CurseForge格式)安裝

# Unzip
source: 解压
ja_jp: 解凍
ru_ru: Распакуйте
zh_hant: 解壓

# UnzipingModPack
source: 正在解压整合包
ja_jp: Modパックを展開中
ru_ru: Распаковка интеграционного пакета
zh_hant: 正在解壓縮整合包

# FinsihUnzipModPack
source: 解压整合包完成
ja_jp: 統合されたパックの解凍が完了しました
ru_ru: Распаковка интеграционного пакета завершена
zh_hant: 解壓縮整合包完成

# GetModPackInfo
source: 获取整合包信息
ja_jp: Modパック情報の取得
ru_ru: Получите информацию о пакете интеграции
zh_hant: 取得整合包資訊

# ModPackInfo
source: 整合包信息
ja_jp: バンドル情報
ru_ru: Интегрируйте информацию о пакете
zh_hant: 整合包資訊

# ImportFailed
source: 导入失败
ja_jp: インポートできません
ru_ru: Импорт не удался
zh_hant: 導入失敗

# ImportSuccess
source: 导入成功
ja_jp: インポート成功
ru_ru: Импорт выполнен успешно
zh_hant: 導入成功

# NoCrashInfo
source: 无崩溃信息
ja_jp: クラッシュ情報はありません
ru_ru: Нет информации о ДТП
zh_hant: 無崩潰訊息

# DownloadModPackMod
source: 下载整合包模组
ja_jp: ModとModをダウンロード
ru_ru: Загрузите модуль Интеграционного пакета
zh_hant: 下載整合包模組

# TotalNumberOfMod
source: 模组总数量
ja_jp: MOD合計
ru_ru: Общее количество модулей
zh_hant: 模組總數量

# DownloadSuccess
source: 下载成功
ja_jp: ダウンロードに成功しました
ru_ru: Загрузка выполнена успешно
zh_hant: 下載成功

# OverrideModPack
source: 覆盖整合包
ja_jp: Modパック
ru_ru: Переопределите интеграционный пакет
zh_hant: 覆蓋整合包

# DownloadFailedFileAgain
source: 重新下载失败文件
ja_jp: 失敗したファイルの再ダウンロード中
ru_ru: Не удалось повторно загрузить файл
zh_hant: 重新下載失敗檔

# Plugin
source: 插件
ja_jp: プラグイン
ru_ru: Плагины
zh_hant: 外掛程式

# EnableAll
source: 启用所有
ja_jp: すべて有効にする
ru_ru: Активируйте все
zh_hant: 啟用所有

# DisableAll
source: 禁用所有
ja_jp: すべて無効にする
ru_ru: Отключить все
zh_hant: 停用所有

# Author
source: 作者
ja_jp: 著者
ru_ru: автор

# Version
source: 版本
ja_jp: バージョン
ru_ru: Версия

# Description
source: 描述
ja_jp: 説明
ru_ru: Описание
zh_hant: 課程描述

# NeedRestartApp
source: 需要重启YMCL
ja_jp: YMCL の再起動が必要です
ru_ru: Необходимо перезапустить YMCL
zh_hant: 需要重啟YMCL

# OnlySupportsWindows10AndAboveSystems
source: 仅支持 Windows 10 以上系统
ja_jp: Windows 10以降でのみ対応
ru_ru: Поддерживает только Windows 10 и выше
zh_hant: 僅支援Windows 10 以上系統

# TaskCenter
source: 任务中心
ja_jp: タスクセンター
ru_ru: Центр задач
zh_hant: 任務中心

# AllType
source: 所有类型
ja_jp: すべてのタイプ
ru_ru: Все типы
zh_hant: 所有類型

# MaterialPack
source: 材质包
ja_jp: テクスチャ パック
ru_ru: Набор материалов
zh_hant: 材質包

# Map
source: 地图
ja_jp: 地図
ru_ru: Карта
zh_hant: 地圖

# CustomBackGroundImg
source: 自定义背景图
ja_jp: 背景をカスタマイズします
ru_ru: Пользовательское фоновое изображение
zh_hant: 自訂背景圖

# SelectImgFile
source: 选择图像文件
ja_jp: イメージ ファイルの選択
ru_ru: Выберите файл изображения
zh_hant: 選擇圖像檔

# MusicNotAvailable
source: 音乐不可用
ja_jp: 音楽は利用できません
ru_ru: Музыка недоступна
zh_hant: 音樂不可用

# MusicGetFail
source: 音乐获取失败
ja_jp: 音楽が取得できませんでした
ru_ru: Не удалось получить музыку
zh_hant: 音樂獲取失敗

# DownloadSource
source: 下载源
ja_jp: ソースをダウンロード
ru_ru: Скачать исходный код
zh_hant: 下載來源

# MaximumDownloadThread
source: 最大下载线程
ja_jp: スレッドの最大ダウンロード
ru_ru: Максимальное количество загружаемых потоков
zh_hant: 最大下載線程

# DownloadThreadTooBigTip
source: 下载线程过大可能导致设备卡顿
ja_jp: スレッドが大きすぎる場合、デバイスカードトンネリングが発生します
ru_ru: Поток загрузки слишком велик и может привести к сбою устройства
zh_hant: 下載線程過大可能導致設備卡頓

# Unknown
source: 未知
ja_jp: 不明
ru_ru: Неизвестны

# ShaderPack
source: 光影包
ja_jp: フォトパック
ru_ru: Легкий Набор

# DataPack
source: 数据包
ja_jp: パケット
ru_ru: Пакеты
zh_hant: 數據包

# Api
source: 应用程序接口
ja_jp: アプリケーション インターフェイス
ru_ru: API
zh_hant: 應用程式介面

# ModPack
source: 整合包
ja_jp: Modパック
ru_ru: Интеграционный пакет

# SaveAudioFile
source: 保存音频文件
ja_jp: 音声ファイルの保存
ru_ru: Сохраните аудиофайл
zh_hant: 儲存音訊檔案

# CustomUpdateUrl
source: 自定义更新Url
ja_jp: カスタムアップデートURL
ru_ru: Пользовательский URL-адрес обновления
zh_hant: 自訂更新Url

# LyricTip
source: 我是歌词 ヾ(≧▽≦*)o
ja_jp: 私が歌詞 ヾ(≧▽≦*)o
ru_ru: I am the lyrics ヾ(≧▽≦*)o
zh_hant: 我是歌詞ヾ(≧▽≦*)o

# MusicPlayerOnlySupportWindows
source: 音乐播放器仅支持Windows
ja_jp: 音楽プレーヤーは Windows のみ対応です
ru_ru: Музыкальный проигрыватель поддерживает только Windows
zh_hant: 音樂播放器僅支援Windows

# LoadAudioFileFail
source: 加载音频文件失败
ja_jp: 音声ファイルの読み込みに失敗しました
ru_ru: Не удалось загрузить аудиофайл
zh_hant: 載入音訊檔案失敗

# LaunchCore
source: 启动核心
ja_jp: コア
ru_ru: Запустите ядро
zh_hant: 啟動核心

# AfterLaunchKeepLauncherVisible
source: 启动完成后保持不变
ja_jp: 起動時に変更しない
ru_ru: Оставьте без изменений после завершения запуска
zh_hant: 啟動完成後保持不變

# AfterLaunchMakeLauncherMinimize
source: 启动完成后最小化
ja_jp: 開始後に最小化
ru_ru: Свернуть после завершения запуска
zh_hant: 啟動完成後最小化

# AfterLaunchExitLauncher
source: 启动完成后关闭
ja_jp: 起動後に終了
ru_ru: Закрыть по завершении запуска
zh_hant: 啟動完成後關閉
