Repository: DaiYu-233/YMCL.Avalonia
Catalog: YMCL.Main/YMCL/Public/Langs/MainLang.*.resx
Languages: ja_jp, ru_ru, zh_hant

# AfterLaunchHideAndShowWhenGameExit
source: 启动完成后隐藏，游戏退出后显示
ja_jp: 起動完了後に非表示にします。ゲームの終了後表示
ru_ru: Скрыть после завершения запуска, показать после выхода из игры
zh_hant: 啟動完成後隱藏，遊戲退出後顯示

# LauncherVisibility
source: 启动器可见性
ja_jp: ランチャーの表示
ru_ru: Видимость пусковой установки
zh_hant: 啟動器可見性

# AfterLaunchMinimizeAndShowWhenGameExit
source: 启动完成后最小化，游戏退出后显示
ja_jp: ブート時に最小化して開始する時間
ru_ru: Свернуть после запуска, показать после выхода из игры
zh_hant: 啟動完成後最小化，遊戲退出後顯示

# UnofficialTip
source: 当前版本为非官方版本，可能遭受病毒攻击。 重定向至 https://ymcl.daiyu.fun/ 下载官方版本。
ja_jp: 現在のバージョンは非公式であり、ウイルスに対して脆弱である可能性があります。 公式バージョンをダウンロードするには、https://ymcl.daiyu.fun/にリダイレクトしてください。
ru_ru: Текущая версия является неофициальной и может быть уязвима для вирусов. Перенаправьте на https://ymcl.daiyu.fun/, чтобы загрузить официальную версию.
zh_hant: 目前版本為非官方版本，可能遭受病毒攻擊。 重定向至https://ymcl.daiyu.fun/ 下載官方版本。

# LanguageTip
source: 在开始设置 Yu Minecraft Launcher 前，需要选择语言。
ja_jp: 言語を選択するために Yu Minecraft ランチャーを準備します。
ru_ru: Вам нужно выбрать язык, прежде чем вы сможете начать настройку Yu Minecraft Launcher.
zh_hant: 在開始設定Yu Minecraft Launcher 前，需要選擇語言。

# Account
source: 账户
ja_jp: アカウント
ru_ru: Аккаунт
zh_hant: 帳戶

# WindowTitleBarStyleTip
source: 设置启动器窗口标题栏的样式，在特定情况启动器样式不受支持。
ja_jp: 特定の場合においてランチャーウィンドウのタイトルバーに表示されるスタイルを設定します。特定のケースでは、ランチャー形式がサポートされません。
ru_ru: Установите стиль заголовка окна лаунчера, в некоторых случаях стиль лаунчера не поддерживается.
zh_hant: 設定啟動器視窗標題列的樣式，在特定情況啟動器樣式不受支援。

# SystemStyle
source: 系统样式
ja_jp: システム
ru_ru: Системный стиль
zh_hant: 系統樣式

# LauncherStyle
source: 启动器样式
ja_jp: ランチャースタイル
ru_ru: Стиль пусковой установки
zh_hant: 啟動器樣式

# MinecraftFolderTip
source: 存放Minecraft数据的文件夹 (.minecraft)
ja_jp: Minecraftデータフォルダ(.minecraft) をホストしています
ru_ru: Папка для данных Minecraft (.minecraft)
zh_hant: 存放Minecraft資料的資料夾(.minecraft)

# ExistingNow
source: 现有的
ja_jp: 利用可能
ru_ru: Существующий
zh_hant: 現有的

# JavaRuntime
source: Java运行时
ja_jp: テスト実行時に
ru_ru: Java Runtime
zh_hant: Java運行時

# JavaRuntimeTip
source: 启动游戏至少需要一个Java运行时。
ja_jp: ゲームを起動するには少なくともJavaランタイムが必要です。
ru_ru: Для запуска игры требуется хотя бы одна среда выполнения Java.
zh_hant: 啟動遊戲至少需要一個Java執行時。

# AccountTip
source: 启动游戏至少需要一个账户，如使用离线账户将无法登入有正版验证的服务器。
ja_jp: ゲームを起動するには最低1度以上アカウントが必要です。認証済みのサーバーにログインできません。
ru_ru: Для запуска игры требуется хотя бы одна учетная запись. Если вы используете автономную учетную запись, вы не сможете войти на сервер с подлинной аутентификацией.
zh_hant: 啟動遊戲至少需要一個帳戶，例如使用離線帳戶將無法登錄有正版驗證的伺服器。

# MusicApi
source: 音乐Api
ja_jp: 音楽Api
ru_ru: Музыка Api
zh_hant: 音樂Api

# ProjectInfo
source: 项目信息
ja_jp: プロジェクト情報
ru_ru: Информация о проекте
zh_hant: 項目資訊

# SaveAs
source: 另存为
ja_jp: 名前を付けて保存
ru_ru: Сохранить как
zh_hant: 另存為

# DeskLyricColor
source: 桌面歌词颜色
ja_jp: デスクトップの歌詞の色
ru_ru: Цвет текста песни Desktop
zh_hant: 桌面歌詞顏色

# DeskLyricAlignment
source: 桌面歌词对齐
ja_jp: デスクトップの歌詞整列
ru_ru: Выравнивание текста на рабочем столе
zh_hant: 桌面歌詞對齊

# AlignLeft
source: 居左对齐
ja_jp: 左揃え
ru_ru: Выровнять по левому краю
zh_hant: 居左對齊

# AlignCenter
source: 居中对齐
ja_jp: 中央揃え
ru_ru: Выравнивание по центру
zh_hant: 居中對齊

# AlignRight
source: 居右对齐
ja_jp: 右揃え
ru_ru: Выровняйте по правому краю
zh_hant: 居右對齊

# DeskLyricSize
source: 桌面歌词大小
ja_jp: デスクトップの歌詞のサイズ
ru_ru: Размер текста на рабочем столе
zh_hant: 桌面歌詞大小

# AutoUpdate
source: 自动更新
ja_jp: 自動更新
ru_ru: Автоматическое обновление
zh_hant: 自動更新

# SkipThisVersion
source: 跳过此版本
ja_jp: このバージョンをスキップ
ru_ru: Пропустить эту версию
zh_hant: 跳過此版本

# SkipVersionTip
source: 已跳过版本 : {version} 前往 设置-启动器-检查更新 可再次获取此版本
ja_jp: スキップされたバージョン : {version} 設定へ移動-イニシエータ-更新をチェックしてこのバージョンを再取得します
ru_ru: Версия пропущена: {version} Перейдите в Настройки - Средство запуска - Проверьте наличие обновлений, чтобы снова получить эту версию
zh_hant: 已跳過版本: {version} 前往 設定-啟動器-檢查更新 可再次取得此版本

# WinSevenAutoUpdateTip
source: 发现新版本 : {version} win10 以下系统(不包括10)不支持自动更新 前往以下链接下载新版本 : “{url}” 前往 设置-下载-自动更新 可关闭自动检查更新
ja_jp: 新しいバージョンが見つかりました: {version} win 10以下のシステム（10を除く）は自動更新をサポートしていない 次のリンクに移動して新しいバージョンをダウンロードします:「{url}」 設定へ移動-ダウンロード-自動更新により自動チェック更新をオフにする
ru_ru: Найдена новая версия: {version} автоматические обновления не поддерживаются на системах ниже Win10 (за исключением 10) Скачайте новую версию по ссылке: «{url}» Перейдите в Настройки - Загрузки - Автоматические обновления, чтобы отключить автоматическую проверку обновлений
zh_hant: 發現新版本: {version} win10 以下系統(不包括10)不支援自動更新 前往以下連結下載新版本: “{url}” 前往 設定-下載-自動更新 可關閉自動檢查更新

# OpenBrowser
source: 打开浏览器
ja_jp: ブラウザーを開く
ru_ru: Откройте браузер
zh_hant: 打開瀏覽器

# CustomHomePageWay_Presetting_JavaNews
source: 预设-Java新闻
ja_jp: プリセット - Javaニュース
ru_ru: Предустановка - Новости Java
zh_hant: 預設-Java新聞

# NetworkSource
source: 网络源
ja_jp: ネットワークプロバイダー
ru_ru: Сетевой источник
zh_hant: 網路來源

# NoSupportNow
source: 现不支持
ja_jp: 現在サポートされていません
ru_ru: Сейчас не поддерживается
zh_hant: 現不支援

# AggregateSearchTip
source: 输入关键词以在YMCL中搜索
ja_jp: キーワードを入力してYMCLで検索
ru_ru: Введите ключевые слова для поиска в YMCL
zh_hant: 輸入關鍵字以在YMCL中搜尋

# CannotRecognitionTheVersion
source: 无法识别选中版本
ja_jp: 選択したバージョンを認識できません
ru_ru: Выбранная версия не распознана
zh_hant: 無法辨識選取版本

# LocalResource
source: 本地资源
ja_jp: ローカルリソース
ru_ru: Местные ресурсы
zh_hant: 本地資源

# InstallVersion
source: 安装版本
ja_jp: バージョンをインストールする
ru_ru: Installed version
zh_hant: 安裝版本

# JumpSearch
source: 跳转搜索
ja_jp: ジャンプ検索
ru_ru: Перейти к поиску
zh_hant: 跳轉搜尋

# AggregateSearchWatermark
source: 输入关键词以在YMCL中搜索
ja_jp: キーワードを入力してYMCLで検索
ru_ru: Введите ключевые слова для поиска в YMCL
zh_hant: 輸入關鍵字以在YMCL中搜尋

# SwitchedTo
source: 已切换到
ja_jp: 切り替え済み
ru_ru: Переключено на
zh_hant: 已切換到

# JumpToSearchTip
source: 将会跳转到 {target} 搜索此关键词
ja_jp: このキーワードは {target} にて検索されます
ru_ru: Вы будете перенаправлены на {target} для поиска по этому ключевому слову
zh_hant: 將會跳到{target} 搜尋此關鍵字

# SearchInTip
source: 在 {target} 中搜索
ja_jp: {target} 内を検索
ru_ru: Искать в {target}
zh_hant: 在{target} 中搜尋

# Music
source: 音乐
ja_jp: 音楽
ru_ru: Музыка
zh_hant: 音樂

# ExistAccount
source: 现存账户
ja_jp: 既存のアカウント
ru_ru: Существующая учетная запись
zh_hant: 現存帳戶

# DisplayIndependentTaskWindow
source: 显示独立任务窗口
ja_jp: 独立タスクウィンドウを表示
ru_ru: Показать отдельное окно задачи
zh_hant: 顯示獨立任務視窗

# Sponsor
source: 赞助
ja_jp: スポンサー
ru_ru: Спонсировано
zh_hant: 贊助

# Sponsors
source: 赞助者
ja_jp: サポーター
ru_ru: Спонсор
zh_hant: 贊助者

# SponsorsTip
source: 以下是发电的赞助者，感谢对 Yu Minecraft Launcher 的支持 ！
ja_jp: 以下はローンチされた運営者です。YuMinecraft ランチャーへの感謝の意しを持ちます！
ru_ru: Ниже перечислены спонсоры производства электроэнергии, спасибо за поддержку Yu Minecraft Launcher!
zh_hant: 以下是發電的贊助者，感謝對Yu Minecraft Launcher 的支持！

# MacOsUpdateTip
source: 发现新版本 : {version} MacOs 不支持自动更新 前往以下链接下载新版本 : “{url}” 前往 设置-下载-自动更新 可关闭自动检查更新
ja_jp: 新しいバージョンが見つかりました : {version} MacOsは自動更新をサポートしていません 次のリンクに移動して新しいバージョンをダウンロードします:「{url}」 設定へ移動-ダウンロード-自動更新により自動チェック更新をオフにする
ru_ru: Найдена новая версия: {version} MacO не поддерживают автоматические обновления Скачайте новую версию по ссылке: «{url}» Перейдите в Настройки - Загрузки - Автоматические обновления, чтобы отключить автоматическую проверку обновлений
zh_hant: 發現新版本: {version}&#10; MacOs 不支援自動更新前往以下連結下載新版本: “{url}”&#10;前往設定-下載-自動更新可關閉自動檢查更新

# AlreadyCopyToClipBoard
source: 已复制到剪切板
ja_jp: クリップボードにコピーしました
ru_ru: Скопировано в буфер обмена
zh_hant: 已複製到剪切板

# UsedMem
source: 已用内存
ja_jp: 使用メモリ
ru_ru: Память использована
zh_hant: 已用記憶體

# CannotLoad
source: 无法加载
ja_jp: 読み込めませんでした
ru_ru: Невозможно загрузить
zh_hant: 無法加載

# LoadFail
source: 加载失败
ja_jp: 読み込みに失敗しました
ru_ru: Не удалось загрузить
zh_hant: 載入失敗

# ToggleNav
source: 切换导航
ja_jp: ナビゲーションの切り替え
ru_ru: Переключить навигацию
zh_hant: 切換導航

# NoWorkingTask
source: 暂无运行中任务
ja_jp: 実行中のタスクはありません
ru_ru: Пока нет текущих задач
zh_hant: 暫無運行中任務

# CrashLa
source: 崩溃啦！ヾ(•ω•`)o
ja_jp: おっと！解釈のための特殊ファイル (• ω • `) o
ru_ru: Crash! (• ω • `) o
zh_hant: 崩潰啦！ヾ(•ω•`)o

# YMCLHappenError
source: Yu Minecraft Launcher 发生未处理异常
ja_jp: YuMinecraft ランチャーが例外を処理していません
ru_ru: Необработанное исключение в Yu Minecraft Launcher
zh_hant: Yu Minecraft Launcher 發生未處理異常

# DetailedInfo
source: 详细信息
ja_jp: 詳細
ru_ru: Предоставляемая
zh_hant: 詳細資料

# UnhandledErrorTip
source: Yu Minecraft Launcher 遇到了没有处理的异常 , 可能无法继续运行 , 下方为异常的详细信息
ja_jp: YuMinecraft ランチャーで処理できない例外が発生しました。サーバを起動できないため、例外の詳細は動作しません
ru_ru: Запуск Yu Minecraft Launcher столкнулся с необработанным исключением и может не продолжаться. Ниже приведены подробности исключения
zh_hant: Yu Minecraft Launcher 遇到了沒有處理的異常, 可能無法繼續運行, 下方為異常的詳細信息

# Copy
source: 复制
ja_jp: コピー
ru_ru: Копирование
zh_hant: 複製

# NoMatterErrorAndKeepOnRun
source: 忽略错误 , 强制继续运行
ja_jp: エラーを無視して、強制し続けます
ru_ru: Игнорируйте ошибку и вынудите операцию продолжить
zh_hant: 忽略錯誤, 強制繼續運作

# ExitApp
source: 退出应用
ja_jp: アプリケーションを終了します
ru_ru: Выйти из приложения
zh_hant: 退出應用程式

# RestartApp
source: 重启应用
ja_jp: アプリを再起動
ru_ru: Перезапустите приложение
zh_hant: 重啟應用

# LoadBackGroudFromPicFailTip
source: 从图像文件加载背景图失败 , 检查图片格式是否正确
ja_jp: 画像ファイルの背景画像ファイルの読み込みに失敗。 画像が正しい形式になっているかどうかを確認してください
ru_ru: Не удалось загрузить фоновое изображение из файла изображения, проверьте правильность формата изображения
zh_hant: 從圖片檔案載入背景圖失敗, 檢查圖片格式是否正確

# CustomBackground
source: 自定义背景
ja_jp: カスタム背景
ru_ru: Пользовательский фон
zh_hant: 自訂背景

# Default
source: 默认
ja_jp: デフォルト
ru_ru: По умолчанию
zh_hant: 預設

# BackGroundImg
source: 背景图
ja_jp: 背景画像
ru_ru: фоновое изображение
zh_hant: 背景圖

# AcrylicBlur
source: 亚克力
ja_jp: 亜克力
ru_ru: Акрил
zh_hant: 亞克力

# Transparent
source: 透明
ja_jp: アルファ
ru_ru: Транспарентность

# CannotFindMinecraftFolder
source: 无法找到Minecraft文件夹
ja_jp: Minecraftフォルダーが見つかりませんでした
ru_ru: Не удалось найти папку Minecraft
zh_hant: 無法找到Minecraft資料夾

# OneSentence
source: 一言
ja_jp: 一言で言えば
ru_ru: Одним словом
zh_hant: 一言API

# TodayLuckyValue
source: 今日人品
ja_jp: 本日のキャラクター
ru_ru: Характер дня

# CannotLoadVersionSetting
source: 无法加载版本设置
ja_jp: バージョン設定を読み込めません
ru_ru: Не удалось загрузить настройки версии
zh_hant: 無法載入版本設定

# TodayLuckyValueTip
source: 今日的人品值是 : {value} !
ja_jp: 今日のキャラクター値：{ value }！
ru_ru: Сегодняшнее значение символа: {value}!

# IKnow
source: 我知道了
ja_jp: 分かっている
ru_ru: Я знаю это

# LuckyValueTip
source: 今天的运气可能不太好，但别灰心，明天会更好！/n今天的运气有点差呢。/n今天的运气一般般。/n今天的运气还行。/n今天的运气不错呢！/n今天的运气非常好！/n今天的运气简直爆棚！/n
ja_jp: 今日の運は悪いかもしれませんが、がっかりしないでください。明日の運は良くなります！/ n今日の運は少し悪いです。/n今日の運は平均的です。/n今日の運は良いです。/n今日の運は良いです！/ n今日の運はとても良いです！/ n今日の運は壊れています！/ n
ru_ru: Сегодняшняя удача может быть плохой, но не расстраивайтесь, завтра будет лучше!/nСегодняшняя удача немного плохая./nСегодняшняя удача средняя./nСегодняшняя удача хорошая./nСегодняшняя удача хорошая!/nСегодняшняя удача очень хорошая!/nСегодняшняя удача ломается!/n
zh_hant: 今天的運氣可能不太好，但別灰心，明天會更好！ /n今天的運氣有點差呢。 /n今天的運氣一般。 /n今天的運氣還好。 /n今天的運氣不錯呢！ /n今天的運氣非常好！ /n今天的運氣簡直爆棚！ /n

# NeverClick
source: 千万别点
ja_jp: ふざけるな
ru_ru: Не смей
zh_hant: 千萬別點

# NeverClickTip
source: 此操作可能会发生奇奇怪怪的问题，确定要继续吗？
ja_jp: この操作は奇妙な問題を引き起こす可能性があります。続行してもよろしいですか？
ru_ru: Эта операция может вызвать странные проблемы, вы уверены, что хотите продолжить?
zh_hant: 此操作可能會發生奇奇怪怪的問題，確定要繼續嗎？

# Tip
source: 提示
ja_jp: ヒント
ru_ru: Указатель

# GameMainFileDeletion
source: 游戏主要文件缺失
ja_jp: メインゲームファイルがありません
ru_ru: Отсутствует основной файл игры
zh_hant: 遊戲主要檔案缺失

# GameUpdateLog
source: 更新日志
ja_jp: ログを更新します
ru_ru: Журнал изменений
zh_hant: 更新日誌

# SureToInstallTheJava
source: 确定要安装 Java : {Java}？
ja_jp: Javaをインストールしてもよろしいですか：{ Java }？
ru_ru: Вы уверены, что хотите установить Java: {Java}?
zh_hant: 確定要安裝Java : {Java}？

# MaxFileFragmentation
source: 最大文件分片
ja_jp: 最大のファイル断片化
ru_ru: Максимальная фрагментация файла

# CreateDownloadTask
source: 创建下载任务
ja_jp: ダウンロードタスクを作成してください
ru_ru: Создайте задачу загрузки
zh_hant: 建立下載任務

# CustomDownload
source: 自定义下载
ja_jp: カスタムダウンロード
ru_ru: Пользовательская загрузка
zh_hant: 自訂下載

# Locate
source: 定位
ja_jp: ポジショニング
ru_ru: Позиционирование

# DownloadUrl
source: 下载链接
ja_jp: ダウンロードリンク： <link>
ru_ru: Ссылка для скачивания
zh_hant: 下載連結

# DisplayName
source: 显示名称
ja_jp: 表示名
ru_ru: Отображаемое имя
zh_hant: 顯示名稱

# Task
source: 任务
ja_jp: クエスト
ru_ru: Миссии
zh_hant: 任務

# More
source: 更多
ja_jp: より多く
ru_ru: Больше

# About
source: 关于
ja_jp: について
ru_ru: ПО ВОПРОСАМ БЕЗОПАСНОСТИ В ЦЕНТРАЛЬНОЙ АФРИКЕ
zh_hant: 關於

# Personalize
source: 个性化
ja_jp: パーソナライズ
ru_ru: Персонализация
zh_hant: 個性化

# Launcher
source: 启动器
ja_jp: ランチャー
ru_ru: Пусковая установка
zh_hant: 啟動器

# ServerUrlError
source: 服务器Url错误
ja_jp: サーバーURLエラー
ru_ru: Ошибка URL-адреса сервера
zh_hant: 伺服器Url錯誤

# Waiting
source: 等待中
ja_jp: 待っています
ru_ru: Ожидание

# Running
source: 运行中
ja_jp: 走っています
ru_ru: В процессе
zh_hant: 運行中

# Paused
source: 已暂停
ja_jp: 一時停止
ru_ru: Пауза
zh_hant: 已暫停

# Error
source: 错误
ja_jp: 不正解
ru_ru: Ошибка
zh_hant: 錯誤

# Finished
source: 已完成
ja_jp: 完了済み
ru_ru: Завершено

# Remove
source: 移除
ja_jp: 削除
ru_ru: Убрать

# BuildLaunchConfig
source: 构建启动配置项
ja_jp: スタートアップコンフィギュレーションアイテムを構築
ru_ru: Создайте элемент конфигурации запуска
zh_hant: 建置啟動配置項

# CheckLaunchArg
source: 检查启动参数
ja_jp: 起動パラメータを確認してください
ru_ru: Проверьте параметры запуска
zh_hant: 檢查啟動參數

# RefreshAccountToken
source: 刷新用户令牌
ja_jp: ユーザートークンを更新してください
ru_ru: Обновить маркер пользователя
zh_hant: 刷新用戶令牌

# LaunchMinecraftProcess
source: 启动 Minecraft 进程
ja_jp: Minecraftプロセスを開始してください
ru_ru: Начните процесс Minecraft
zh_hant: 啟動Minecraft 進程

# Canceled
source: 已取消
ja_jp: キャンセルしました
ru_ru: Отменено

# Canceling
source: 取消中
ja_jp: キャンセルしています
ru_ru: Отмена

# CheckVersionResource
source: 检查版本资源
ja_jp: バージョンリソースを確認してください
ru_ru: Проверьте ресурсы версии
zh_hant: 檢查版本資源

# DownloadResource
source: 下载资源
ja_jp: 資源をダウンロード
ru_ru: Загрузите ресурсы
zh_hant: 下載資源

# Return
source: 返回
ja_jp: 戻る
ru_ru: Назад

# ScreenshotsFolder
source: 截图文件夹
ja_jp: スクリーンショットフォルダ
ru_ru: Папка скриншотов
zh_hant: 截圖資料夾

# Saves
source: 存档
ja_jp: アーカイブ
ru_ru: файл сохранения
zh_hant: 存檔

# Screenshots
source: 截图
ja_jp: スクリーンショット
ru_ru: Скриншот
zh_hant: 截圖

# ResourcePacks
source: 资源包
ja_jp: 資源パック
ru_ru: Набор ресурсов
zh_hant: 資源包

# NoMatchResult
source: 无匹配结果
ja_jp: 一致する結果はありません
ru_ru: Нет подходящих результатов
zh_hant: 無匹配結果

# CreateTime
source: 创建时间
ja_jp: 作成日時
ru_ru: Время создания
zh_hant: 創建時間

# LastModifiedTime
source: 最后修改时间
ja_jp: 最終更新日
ru_ru: Последнее изменение&#xA0;%s
zh_hant: 最後修改時間

# SaveInfo
source: 存档信息
ja_jp: アーカイブ情報
ru_ru: Архивировать информацию
zh_hant: 存檔資訊

# Name
source: 名称
ja_jp: 名前
ru_ru: Название
zh_hant: 名稱

# PlayerCount
source: 玩家数量
ja_jp: プレイヤー数
ru_ru: Количество игроков
zh_hant: 玩家數量

# DataPackCount
source: 数据包数量
ja_jp: パケット数
ru_ru: Количество пакетов
zh_hant: 資料包數量

# ImportTime
source: 导入时间
ja_jp: インポート日時
ru_ru: Импортировать время
zh_hant: 導入時間

# CanceledUpdate
source: 更新已取消
ja_jp: 更新がキャンセルされました
ru_ru: Обновление отменено

# ApiError
source: Api错误
ja_jp: APIエラー
ru_ru: Ошибка API
zh_hant: Api錯誤

# NetWorkError
source: 网络错误
ja_jp: ネットワークにエラーが発生しました
ru_ru: Ошибка сети
zh_hant: 網路錯誤

# KillProcess
source: 结束进程
ja_jp: プロセスを終了します
ru_ru: Завершите процесс
zh_hant: 結束進程

# LaunchArguments
source: 启动参数
ja_jp: スタートアップパラメータ
ru_ru: Параметры запуска
zh_hant: 啟動參數

# DisplayLaunchArguments
source: 显示启动参数
ja_jp: スタートアップパラメータを表示
ru_ru: Показать параметры запуска
zh_hant: 顯示啟動參數

# ResetData
source: 重置数据
ja_jp: データをリセット
ru_ru: Сбросить данные
zh_hant: 重置數據

# FixLoadDataFailTip
source: 在加载数据时遇到异常，这可能是由于数据发生损坏导致的。是否重置YMCL数据以解决此问题？
ja_jp: データの読み込み中に例外が発生しました。データが破損している可能性があります。これを修正するためにYMCLデータをリセットしますか？
ru_ru: При загрузке данных возникло исключение, которое может быть связано с повреждением данных. Вы хотите сбросить данные YMCL, чтобы исправить это?
zh_hant: 在載入資料時遇到異常，這可能是由於資料發生損壞導致的。是否重置YMCL數據以解決此問題？

# Export
source: 导出
ja_jp: エクスポート
ru_ru: Экспорт
zh_hant: 導出

# ExportLogFile
source: 导出日志文件
ja_jp: ログファイルをエクスポート
ru_ru: Экспортировать файл журнала
zh_hant: 匯出日誌檔

# AutoScrollToEnd
source: 自动滚动到末尾
ja_jp: 最後まで自動的にスクロール
ru_ru: Автоматически прокручивать до конца
zh_hant: 自動滾動到末尾

# GetJavaInfoFail
source: 获取Java信息失败 可能此Java不正确/已损坏/无执行权限
ja_jp: Java情報の取得に失敗しました このJavaが正しくない/破損している/実行権限がない可能性があります
ru_ru: Не удалось получить информацию о Java Возможно, эта Java неверна/повреждена/не имеет прав на выполнение
zh_hant: 取得Java資訊失敗可能此Java不正確/已損壞/無執行權限

# Seed
source: 种子
ja_jp: 種
ru_ru: Семена
zh_hant: 種子

# AllowCommands
source: 允许命令
ja_jp: コマンドを許可してください
ru_ru: Разрешить команды
zh_hant: 允許命令

# GameType
source: 游戏类型
ja_jp: ゲームタイプ
ru_ru: Тип игры
zh_hant: 遊戲類型

# LastPlayTime
source: 最后游玩时间
ja_jp: ラストプレイタイム
ru_ru: Время последней игры
zh_hant: 最後遊玩時間

# NoDescription
source: 无描述信息
ja_jp: 説明がありません
ru_ru: Нет описания
zh_hant: 無描述訊息

# Mica
source: 云母
ja_jp: 雲母
ru_ru: Слюда
zh_hant: 雲母

# TranslucentBackgroundOpacity
source: 半透明背景控件不透明度
ja_jp: 半透明の背景コントロールの不透明度
ru_ru: Непрозрачность полупрозрачного элемента управления фоном
zh_hant: 半透明背景控制不透明度

# MusicApiWithIP
source: 音乐Api附带IP地址
ja_jp: Music ApiにはIPアドレスが付属しています
ru_ru: Music Api поставляется с IP-адресом
zh_hant: 音樂Api附IP位址

# NoIdentifiedPlugins
source: 暂无已识别插件
ja_jp: プラグインがまだ識別されていません
ru_ru: Плагины еще не определены
zh_hant: 暫無已辨識插件

# LoadPluginError
source: 加载插件错误
ja_jp: プラグインの読み込み中にエラーが発生しました
ru_ru: Ошибка загрузки плагина
zh_hant: 載入插件錯誤

# Unrecognized
source: 无法识别
ja_jp: 認識されません
ru_ru: Неизвестно
zh_hant: 無法辨識

# ImportModPack
source: 导入整合包
ja_jp: インテグレーションパッケージをインポート
ru_ru: Импортируйте интеграционный пакет
zh_hant: 導入整合包

# Prepare
source: 准备
ja_jp: 準備
ru_ru: Приготовиться
zh_hant: 準備

# VersionIdCannotBeEmpty
source: 版本 Id 不可为空
ja_jp: バージョンIDを空にすることはできません
ru_ru: Идентификатор версии не может быть пустым
zh_hant: 版本Id 不可為空白

# InstallModPack
source: 安装整合包
ja_jp: インテグレーションパックをインストールしてください
ru_ru: Установите интеграционный пакет
zh_hant: 安裝整合包

# PrepareInstall
source: 准备安装
ja_jp: インストールの準備ができました
ru_ru: Готово к установке
zh_hant: 準備安裝

# SaveSkinFile
source: 保存皮肤文件
ja_jp: スキンファイルを保存
ru_ru: Сохранить файл скина
zh_hant: 保存皮膚文件

# SaveFinish
source: 保存完成
ja_jp: 保存しました
ru_ru: Сохранено
zh_hant: 儲存完成

# CornerRadius
source: 圆角半径
ja_jp: 丸みを帯びた半径
ru_ru: Радиус закругления
zh_hant: 圓角半徑

# EnableTranslucentSpecialControlList
source: 启用半透明特殊控件列表
ja_jp: 半透明の特別なコントロールリストを有効にします
ru_ru: Включить полупрозрачный специальный контрольный список
zh_hant: 啟用半透明特殊控制項清單

# NoticeWay
source: 通知方式
ja_jp: 通知方法
ru_ru: Способ уведомления

# NotificationCard
source: 通知卡片
ja_jp: 通知カード
ru_ru: Карта уведомлений

# NotificationBubble
source: 通知气泡
ja_jp: 通知バブル
ru_ru: Пузыри уведомлений
zh_hant: 通知氣泡

# ExampleNotification
source: 示例通知
ja_jp: 通知のサンプル
ru_ru: Примеры уведомлений
zh_hant: 範例通知

# CurrentListIsEmpty
source: 当前列表为空
ja_jp: 現在のリストは空です
ru_ru: Текущий список пуст
zh_hant: 目前列表為空

# Import
source: 导入
ja_jp: 導入
ru_ru: Импорт
zh_hant: 導入

# HopeHowToHandleTheFile
source: 希望如何处理此文件
ja_jp: このファイルをどうしますか
ru_ru: Что вы хотите сделать с этим файлом
zh_hant: 希望如何處理此文件

# AsResourcePackImport
source: 作为资源包导入
ja_jp: アセットパッケージとしてインポート
ru_ru: Импортировать как пакет активов
zh_hant: 作為資源包導入

# AsShaderPackImport
source: 作为光影包导入
ja_jp: 軽量パッケージとしてインポートされました
ru_ru: Импортируется как легкий пакет
zh_hant: 作為光影包導入

# Conflict
source: 冲突
ja_jp: 衝突
ru_ru: Противоречит
zh_hant: 沖突

# FileConflictTip
source: 文件冲突，目标文件夹已存在相同名称文件，希望如何处理复制操作？
ja_jp: ファイルが競合しています。コピー先フォルダーに同じ名前のファイルがすでにあります。コピー操作をどのように処理しますか？
ru_ru: Конфликт файлов, в папке назначения уже есть файл с таким именем, как вы хотите обработать операцию копирования?
zh_hant: 文件衝突，目標資料夾已存在相同名稱文件，希望如何處理複製操作？

# Cover
source: 覆盖
ja_jp: 重ね合わせ
ru_ru: Перезаписать
zh_hant: 覆蓋

# Rename
source: 重命名
ja_jp: 名前を変更
ru_ru: &Переименовать
zh_hant: 重新命名

# ImportFinish
source: 导入完成
ja_jp: インポートが完了しました
ru_ru: Импорт завершен
zh_hant: 導入完成

# SureToImportTheFile
source: 确定导入此文件
ja_jp: このファイルをインポートできます
ru_ru: ОК для импорта этого файла
zh_hant: 確定導入此文件

# AllImport
source: 全部导入
ja_jp: すべてインポート
ru_ru: Импортировать все
zh_hant: 全部導入

# MinecraftVersion
source: Minecraft 版本
ja_jp: Minecraftバージョン
ru_ru: Версия Minecraft

# Home
source: 主页
ja_jp: ホームページ
ru_ru: Стартовая страница
zh_hant: 主頁

# HotResource
source: 热门资源
ja_jp: トップ資源
ru_ru: Лучшие ресурсы
zh_hant: 熱門資源

# All
source: 全部
ja_jp: すべて
ru_ru: полностью

# ServerPack
source: 服务器包
ja_jp: サーバーパッケージ
ru_ru: Пакет сервера
zh_hant: 伺服器包

# DownloadUrlParserFail
source: 下载链接解析失败
ja_jp: ダウンロードリンクの解析に失敗しました
ru_ru: Не удалось выполнить разбор ссылок для загрузки
zh_hant: 下載連結解析失敗

# Destroy
source: 销毁
ja_jp: 破壊しろ
ru_ru: Уничтожить
zh_hant: 銷毀

# Favourite
source: 收藏
ja_jp: コレクション
ru_ru: Коллекционирование

# Favourted
source: 已收藏
ja_jp: お気に入り
ru_ru: Сохранено

# Favourites
source: 收藏夹
ja_jp: お気に入り
ru_ru: Закладка
zh_hant: 收藏夾

# CurrectSystemNoSupportAutoUpdateTip
source: 当前系统不支持自动更新 可前往 设置-下载 关闭自动更新 可手动下载最新版本并替换程序文件
ja_jp: 自動更新は現在のシステムではサポートされていません [設定] - [ダウンロード]に移動して自動更新をオフにします 最新バージョンを手動でダウンロードして、プログラムファイルを置き換えることができます
ru_ru: Автоматические обновления не поддерживаются в текущей системе Откройте Настройки - Загрузки, чтобы отключить автоматические обновления. Вы можете вручную загрузить последнюю версию и заменить файл программы
zh_hant: 目前系統不支援自動更新 可前往 設定-下載 關閉自動更新 可手動下載最新版本並取代程式檔案

# DependencyItems
source: 依赖项
ja_jp: 依存関係
ru_ru: Зависимости
zh_hant: 依賴項

# ImportOrExportSetting
source: 导入/导出设置
ja_jp: インポート/エクスポート設定
ru_ru: Настройки импорта/экспорта
zh_hant: 導入/匯出設定

# ExportSettingTip
source: 选择需要导出的设置项
ja_jp: エクスポートする設定を選択してください
ru_ru: Выберите настройки, которые вы хотите экспортировать
zh_hant: 選擇需要匯出的設定項

# ExchangeSetting_Ui
source: 界面设置
ja_jp: インターフェース設定
ru_ru: Настройки интерфейса
zh_hant: 介面設定

# ExchangeSetting_Net
source: 网络设置
ja_jp: ネットワーク設定
ru_ru: Настройки сети
zh_hant: 網路設定

# ExchangeSetting_Launch
source: 启动设置
ja_jp: 設定を起動してください
ru_ru: Запустите настройки
zh_hant: 啟動設定

# ExchangeSetting_Account
source: 账户数据(不含微软帐户)
ja_jp: アカウントデータ（ Microsoftアカウントを除く）
ru_ru: Данные учетной записи (за исключением учетной записи Майкрософт)
zh_hant: 帳戶資料(不含微軟帳戶)

# ExchangeSetting_Other
source: 其他设置
ja_jp: その他の設定
ru_ru: Другое
zh_hant: 其他設定

# ExportSuccess
source: 导出成功
ja_jp: エクスポートに成功しました
ru_ru: Экспорт выполнен успешно
zh_hant: 導出成功

# ExportSettingSuccessTip
source: 导出成功，数据量过大无法显示，点击复制以复制所有数据
ja_jp: エクスポートに成功しました。データ量が大きすぎて表示できません。[コピー]をクリックしてすべてのデータをコピーします
ru_ru: Экспорт выполнен успешно, объем данных слишком велик для отображения, нажмите «Копировать», чтобы скопировать все данные
zh_hant: 匯出成功，資料量過大無法顯示，點選複製以複製所有資料

# ImportSettingTextBoxWatermark
source: 输入hex数据
ja_jp: 16進数データを入力してください
ru_ru: Введите шестнадцатеричные данные
zh_hant: 輸入hex資料

# ReadClipBoard
source: 读取剪贴板
ja_jp: クリップボードを読んでください
ru_ru: Читать буфер обмена
zh_hant: 讀取剪貼簿

# CopyToClipBoard
source: 复制到剪贴板
ja_jp: クリップボードにコピーしました
ru_ru: Копировать в буфер обмена
zh_hant: 複製到剪貼簿

# OpenFile
source: 打开文件
ja_jp: ファイルを開く
ru_ru: &Открыть файл
zh_hant: 開啟檔案

# WriteIn
source: 写入
ja_jp: 書き込み処理
ru_ru: Пишите
zh_hant: 寫入

# OperateFailed
source: 操作失败
ja_jp: 操作に失敗しました
ru_ru: Не удалось выполнить операцию
zh_hant: 操作失敗

# NeedToManuallyOpenTheTerminalAndExecuteTheFollowingCommand
source: 需要手动打开终端执行以下命令
ja_jp: 次のコマンドを実行するには、端末を手動で開く必要があります
ru_ru: Вам необходимо вручную открыть терминал, чтобы выполнить следующую команд
zh_hant: 需要手動打開終端機執行以下命令

# AccountName
source: 账户名称
ja_jp: アカウント名
ru_ru: Наименование счёта
zh_hant: 帳戶名稱

# AddNewAccountUuid
source: Uuid，留空则自动生成
ja_jp: UUID、自動生成するには空白のままにしてください
ru_ru: Uuid, оставьте пустым для автоматической генерации
zh_hant: Uuid，留空則自動產生

# AutoAllocate
source: 自动分配
ja_jp: 自動分配
ru_ru: Автоматическое назначение
zh_hant: 自動分配

# EnableAutoAllocateMem
source: 启用自动分配内存
ja_jp: 自動メモリ割り当てを有効にしてください
ru_ru: Включить автоматическое выделение памяти
zh_hant: 啟用自動分配記憶體

# Custom
source: 自定义
ja_jp: ユーザ設定
ru_ru: Пользовательское
zh_hant: 自訂

# OperateSuccess
source: 操作成功
ru_ru: Операция выполнена успешно
