Repository: DaiYu-233/YMCL.Avalonia
Catalog: YMCL.Main/Public/Langs/MainLang.*.resx
Languages: ja_jp, ru_ru, zh_hant

source: Enable All
ja_jp: すべて有効にする
ru_ru: Активируйте все
zh_hant: 啟用所有

source: Disable All
ja_jp: すべて無効にする
ru_ru: Отключить все
zh_hant: 停用所有

source: Author
ja_jp: 著者
ru_ru: автор
zh_hant: 作者

source: Version
ja_jp: バージョン
ru_ru: Версия
zh_hant: 版本

source: Description
ja_jp: 説明
ru_ru: Описание
zh_hant: 課程描述

# NeedRestartApp
source: YMCL needs to be restarted
ja_jp: YMCL の再起動が必要です
ru_ru: Необходимо перезапустить YMCL
zh_hant: 需要重啟YMCL

# OnlySupportsWindows10AndAboveSystems
source: Only supports Windows 10 and above
ja_jp: Windows 10以降でのみ対応
ru_ru: Поддерживает только Windows 10 и выше
zh_hant: 僅支援Windows 10 以上系統

# NavTask
source: TaskManage
ja_jp: 開くべきクリック ギルドVault 4
ru_ru: Миссии
zh_hant: 任務

source: task center
ja_jp: タスクセンター
ru_ru: Центр задач
zh_hant: 任務中心

# AllType
source: All Types
ja_jp: すべてのタイプ
ru_ru: Все типы
zh_hant: 所有類型

# MaterialPack
source: Texture pack
ja_jp: テクスチャ パック
ru_ru: Набор материалов
zh_hant: 材質包

# Map
source: Maps
ja_jp: 地図
ru_ru: Карта
zh_hant: 地圖

# CustomBackGroundImg
source: Custom Background Image
ja_jp: 背景をカスタマイズします
ru_ru: Пользовательское фоновое изображение
zh_hant: 自訂背景圖

# SelectImgFile
source: Select an item for editing
ja_jp: イメージ ファイルの選択
ru_ru: Выберите файл изображения
zh_hant: 選擇圖像檔

source: Music not available
ja_jp: 音楽は利用できません
ru_ru: Музыка недоступна
zh_hant: 音樂不可用

# MusicGetFail
source: Failed to get music
ja_jp: 音楽が取得できませんでした
ru_ru: Не удалось получить музыку
zh_hant: 音樂獲取失敗

source: Download Source
ja_jp: ソースをダウンロード
ru_ru: Скачать исходный код
zh_hant: 下載來源

# MaximumDownloadThread
source: Max Download Threads
ja_jp: スレッドの最大ダウンロード
ru_ru: Максимальное количество загружаемых потоков
zh_hant: 最大下載線程

# DownloadThreadTooBigTip
source: The download thread is too large and may cause the device to crash
ja_jp: スレッドが大きすぎる場合、デバイスカードトンネリングが発生します
ru_ru: Поток загрузки слишком велик и может привести к сбою устройства
zh_hant: 下載線程過大可能導致設備卡頓

source: Unknown
ja_jp: 不明
ru_ru: Неизвестны
zh_hant: 未知

# ShaderPack
source: Light Pack
ja_jp: フォトパック
ru_ru: Легкий Набор
zh_hant: 光影包

# DataPack
source: Packs
ja_jp: パケット
ru_ru: Пакеты
zh_hant: 數據包

# Api
source: APIs
ja_jp: アプリケーション インターフェイス
ru_ru: API
zh_hant: 應用程式介面

# ModPack
source: Integration Package
ja_jp: Modパック
ru_ru: Интеграционный пакет
zh_hant: 整合包

# SaveAudioFile
source: Save the audio file
ja_jp: 音声ファイルの保存
ru_ru: Сохраните аудиофайл
zh_hant: 儲存音訊檔案

source: Custom Update Url
ja_jp: カスタムアップデートURL
ru_ru: Пользовательский URL-адрес обновления
zh_hant: 自訂更新Url

# LyricTip
source: I am the lyrics (≧▽ ≦ *) o
ja_jp: 私が歌詞 ヾ(≧▽≦*)o
ru_ru: I am the lyrics ヾ(≧▽≦*)o
zh_hant: 我是歌詞ヾ(≧▽≦*)o

# MusicPlayerOnlySupportWindows
source: Music player only supports Windows
ja_jp: 音楽プレーヤーは Windows のみ対応です。
ru_ru: Музыкальный проигрыватель поддерживает только Windows
zh_hant: 音樂播放器僅支援Windows

# LoadAudioFileFail
source: Failed to load audio file
ja_jp: 音声ファイルの読み込みに失敗しました
ru_ru: Не удалось загрузить аудиофайл
zh_hant: 載入音訊檔案失敗

source: Launch Core
ja_jp: コア
ru_ru: Запустите ядро
zh_hant: 啟動核心

# AfterLaunchKeepLauncherVisible
source: Leave unchanged after startup is complete
ja_jp: 起動時に変更しない
ru_ru: Оставьте без изменений после завершения запуска
zh_hant: 啟動完成後保持不變

# AfterLaunchMakeLauncherMinimize
source: Minimize after startup is complete
ja_jp: 開始後に最小化
ru_ru: Свернуть после завершения запуска
zh_hant: 啟動完成後最小化

# AfterLaunchExitLauncher
source: Close when startup is complete
ja_jp: 起動後に終了
ru_ru: Закрыть по завершении запуска
zh_hant: 啟動完成後關閉

# AfterLaunchHideAndShowWhenGameExit
source: Hide after startup is complete, show after game exits
ja_jp: 起動完了後に非表示にします。ゲームの終了後表示
ru_ru: Скрыть после завершения запуска, показать после выхода из игры
zh_hant: 啟動完成後隱藏，遊戲退出後顯示

source: Launcher Visibility
ja_jp: ランチャーの表示
ru_ru: Видимость пусковой установки
zh_hant: 啟動器可見性

# AfterLaunchMinimizeAndShowWhenGameExit
source: Minimize after startup, show after game exits
ja_jp: ブート時に最小化して開始する時間
ru_ru: Свернуть после запуска, показать после выхода из игры
zh_hant: 啟動完成後最小化，遊戲退出後顯示

# UnofficialTip
source: The current version is unofficial and may be vulnerable to viruses. Redirect to https://ymcl.daiyu.fun/ to download the official version.
ja_jp: 現在のバージョンは非公式であり、ウイルスに対して脆弱である可能性があります。 公式バージョンをダウンロードするには、https://ymcl.daiyu.fun/にリダイレクトしてください。
ru_ru: Текущая версия является неофициальной и может быть уязвима для вирусов. Перенаправьте на https://ymcl.daiyu.fun/, чтобы загрузить официальную версию.
zh_hant: 目前版本為非官方版本，可能遭受病毒攻擊。 重定向至https://ymcl.daiyu.fun/ 下載官方版本。

# LanguageTip
source: You need to select a language before you can start setting up Yu Minecraft Launcher.
ja_jp: 言語を選択するために Yu Minecraft ランチャーを準備します。
ru_ru: Вам нужно выбрать язык, прежде чем вы сможете начать настройку Yu Minecraft Launcher.
zh_hant: 在開始設定Yu Minecraft Launcher 前，需要選擇語言。

source: Account
ja_jp: アカウント
ru_ru: Аккаунт
zh_hant: 帳戶

# WindowTitleBarStyleTip
source: Set the style of the launcher window title bar, in certain cases the launcher style is not supported.
ja_jp: 特定の場合においてランチャーウィンドウのタイトルバーに表示されるスタイルを設定します。特定のケースでは、ランチャー形式がサポートされません。
ru_ru: Установите стиль заголовка окна лаунчера, в некоторых случаях стиль лаунчера не поддерживается.
zh_hant: 設定啟動器視窗標題列的樣式，在特定情況啟動器樣式不受支援。

source: System Style
ja_jp: システム
ru_ru: Системный стиль
zh_hant: 系統樣式

source: Launcher style
ja_jp: ランチャースタイル
ru_ru: Стиль пусковой установки
zh_hant: 啟動器樣式

# MinecraftFolderTip
source: Folder for Minecraft data (.minecraft)
ja_jp: Minecraftデータフォルダ(.minecraft) をホストしています
ru_ru: Папка для данных Minecraft (.minecraft)
zh_hant: 存放Minecraft資料的資料夾(.minecraft)

# ExistingNow
source: Existing
ja_jp: 利用可能
ru_ru: Существующий
zh_hant: 現有的

source: Java Runtime
ja_jp: テスト実行時に
zh_hant: Java運行時

# JavaRuntimeTip
source: At least one Java runtime is required to start the gam.
ja_jp: ゲームを起動するには少なくともJavaランタイムが必要です。
ru_ru: Для запуска игры требуется хотя бы одна среда выполнения Java.
zh_hant: 啟動遊戲至少需要一個Java執行時。

# AccountTip
source: At least one account is required to launch the game. If you use an offline account, you will not be able to log in to a server with genuine authentication.
ja_jp: ゲームを起動するには最低1度以上アカウントが必要です。認証済みのサーバーにログインできません。
ru_ru: Для запуска игры требуется хотя бы одна учетная запись. Если вы используете автономную учетную запись, вы не сможете войти на сервер с подлинной аутентификацией.
zh_hant: 啟動遊戲至少需要一個帳戶，例如使用離線帳戶將無法登錄有正版驗證的伺服器。

# MusicApi
source: Music Apis
ja_jp: 音楽Api
ru_ru: Музыка Api
zh_hant: 音乐Api

source: Project Info
ja_jp: プロジェクト情報
ru_ru: 项目信息
zh_hant: 项目信息

source: Save as
ja_jp: 名前を付けて保存
ru_ru: 另存为
zh_hant: 另存为

# DeskLyricColor
source: Desktop Lyrics Color
ja_jp: デスクトップの歌詞の色
ru_ru: 桌面歌词颜色
zh_hant: 桌面歌词颜色

# DeskLyricAlignment
source: Desktop Lyrics Align
ja_jp: デスクトップの歌詞整列
ru_ru: 桌面歌词对齐
zh_hant: 桌面歌词对齐

source: Align Left
ja_jp: 左揃え
ru_ru: 居左对齐
zh_hant: 居左对齐

source: Align center
ja_jp: 中央揃え
ru_ru: 居中对齐
zh_hant: 居中对齐

source: Align Right
ja_jp: 右揃え
ru_ru: 居右对齐
zh_hant: 居右对齐

# DeskLyricSize
source: Desktop Lyrics Size
ja_jp: デスクトップの歌詞のサイズ
ru_ru: 桌面歌词大小
zh_hant: 桌面歌词大小

source: Auto Update
ja_jp: 自動更新
ru_ru: 自动更新
zh_hant: 自动更新

source: Skip This Version
ja_jp: このバージョンをスキップ
ru_ru: 跳过此版本
zh_hant: 跳过此版本

# SkipVersionTip
source: Skip version:{version}. Go to Settings-Launcher-Check Updates download this version.
ja_jp: スキップされたバージョン : {version} 設定へ移動-イニシエータ-更新をチェックしてこのバージョンを再取得します
ru_ru: 已跳过版本 : {version} 前往 设置-启动器-检查更新 可再次获取此版本
zh_hant: 已跳过版本 : {version} 前往 设置-启动器-检查更新 可再次获取此版本

# WinSevenAutoUpdateTip
source: New version:{version} Above Windows 10 can't auto updates. Go to "{url}" download new version. Go to Settings-Download-Auto Update can disable auto check update.
ja_jp: 新しいバージョンが見つかりました: {version} win 10以下のシステム（10を除く）は自動更新をサポートしていない 次のリンクに移動して新しいバージョンをダウンロードします:「{url}」 設定へ移動-ダウンロード-自動更新により自動チェック更新をオフにする
ru_ru: 发现新版本 : {version} win10 以下系统(不包括10)不支持自动更新 前往以下链接下载新版本 : “{url}” 前往 设置-下载-自动更新 可关闭自动检查更新
zh_hant: 发现新版本 : {version} win10 以下系统(不包括10)不支持自动更新 前往以下链接下载新版本 : “{url}” 前往 设置-下载-自动更新 可关闭自动检查更新

source: Open Browser
ja_jp: ブラウザーを開く
ru_ru: 打开浏览器
zh_hant: 打开浏览器

# CustomHomePageWay_Presetting_JavaNews
source: Preset - Minecraft: Java Edition News
ja_jp: プリセット - Javaニュース
ru_ru: 预设-Java新闻
zh_hant: 预设-Java新闻

source: Network Source
ja_jp: ネットワークプロバイダー
ru_ru: 网络源
zh_hant: 网络源

# NoSupportNow
source: Not supported
ja_jp: 現在サポートされていません
ru_ru: 现不支持
zh_hant: 现不支持

# AggregateSearchTip
source: Enter keyword to search in Ymcl
ja_jp: キーワードを入力してYMCLで検索
ru_ru: 输入关键词以在YMCL中搜索
zh_hant: 输入关键词以在YMCL中搜索

# CannotRecognitionTheVersion
source: Can't Recognition The Version
ja_jp: 選択したバージョンを認識できません。
ru_ru: 无法识别选中版本
zh_hant: 无法识别选中版本

# LocalResource
source: Local Resources
ja_jp: ローカルリソース
ru_ru: 本地资源
zh_hant: 本地资源

source: Install Version
ja_jp: バージョンをインストールする
ru_ru: 安装版本
zh_hant: 安装版本

source: Jump Search
ja_jp: ジャンプ検索
ru_ru: 跳转搜索
zh_hant: 跳转搜索

# AggregateSearchWatermark
source: Enter keyword to search in Ymcl
ja_jp: キーワードを入力してYMCLで検索
ru_ru: 输入关键词以在YMCL中搜索
zh_hant: 输入关键词以在YMCL中搜索

source: Switched to
ja_jp: 切り替え済み
ru_ru: 已切换到
zh_hant: 已切换到

# JumpToSearchTip
source: Jump to {target} to search
ja_jp: このキーワードは {target} にて検索されます
ru_ru: 将会跳转到 {target} 搜索此关键词
zh_hant: 将会跳转到 {target} 搜索此关键词

# SearchInTip
source: Search in {target}
ja_jp: {target} 内を検索
ru_ru: 在 {target} 中搜索
zh_hant: 在 {target} 中搜索

# NavSearch
source: Search
ja_jp: 検索
ru_ru: 搜索
zh_hant: 搜索

source: Music
ja_jp: 音楽
ru_ru: 音乐
zh_hant: 音乐

# ExistAccount
source: Existing accounts
ja_jp: 既存のアカウント
ru_ru: 现存账户
zh_hant: 现存账户

# DisplayIndependentTaskWindow
source: Show independent task window
ja_jp: 独立タスクウィンドウを表示
ru_ru: 显示独立任务窗口
zh_hant: 显示独立任务窗口

# Sponsor
source: sponsored
ja_jp: スポンサー
ru_ru: 赞助
zh_hant: 赞助

source: Sponsors
ja_jp: サポーター
ru_ru: 赞助者
zh_hant: 赞助者

# SponsorsTip
source: Below are sponsors. Thank you for your support to Yu Minecraft Launcher!
ja_jp: 以下はローンチされた運営者です。YuMinecraft ランチャーへの感謝の意しを持ちます！
ru_ru: 以下是发电的赞助者，感谢对 Yu Minecraft Launcher 的支持 ！
zh_hant: 以下是发电的赞助者，感谢对 Yu Minecraft Launcher 的支持 ！

# MacOsUpdateTip
source: New version:{version} macOS can't auto updates. Go to "{url}" download new version. Go to Settings-Download-Auto Update can disable auto check update.
ja_jp: 新しいバージョンが見つかりました : {version} MacOsは自動更新をサポートしていません 次のリンクに移動して新しいバージョンをダウンロードします:「{url}」 設定へ移動-ダウンロード-自動更新により自動チェック更新をオフにする
ru_ru: 发现新版本 : {version} MacOs 不支持自动更新 前往以下链接下载新版本 : “{url}” 前往 设置-下载-自动更新 可关闭自动检查更新
zh_hant: 发现新版本 : {version} MacOs 不支持自动更新 前往以下链接下载新版本 : “{url}” 前往 设置-下载-自动更新 可关闭自动检查更新

# CurrectSystemNoSupportAutoUpdateTip
source: Auto-update is not supported by current system to manually open the following directory to copy the latest version and replace the current version
ja_jp: 現在のシステムでは自動更新はサポートされていません 次のディレクトリを手動で開いて最新バージョンをコピーし、現在のバージョンを置き換えることができます
ru_ru: 当前系统不支持自动更新 可手动打开以下目录复制最新版本并替换当前版本
zh_hant: 当前系统不支持自动更新 可手动打开以下目录复制最新版本并替换当前版本

# AlreadyCopyToClipBoard
source: Copied to clipboard
ja_jp: クリップボードにコピーしました
ru_ru: 已复制到剪切板
zh_hant: 已复制到剪切板

# NavAbout
source: About
ja_jp: アプリについて
ru_ru: 关于
zh_hant: 关于

# UsedMem
source: Used Memory
ja_jp: 使用メモリ
ru_ru: 已用内存
zh_hant: 已用内存

# CannotLoad
source: Can't load
ja_jp: 読み込めませんでした
ru_ru: 无法加载
zh_hant: 无法加载

# LoadFail
source: Loading failed
ja_jp: 読み込みに失敗しました
ru_ru: 加载失败
zh_hant: 加载失败

# ToggleNav
source: Toggle Navigation
ja_jp: ナビゲーションの切り替え
ru_ru: 切换导航
zh_hant: 切换导航

# NoWorkingTask
source: No running tasks
ja_jp: 実行中のタスクはありません
ru_ru: 暂无运行中任务
zh_hant: 暂无运行中任务

# CrashLa
source: Crash! Springtime `)o
ja_jp: おっと！解釈のための特殊ファイル (•ω`)
ru_ru: 崩溃啦！ヾ(•ω•`)o
zh_hant: 崩溃啦！ヾ(•ω•`)o

# YMCLHappenError
source: Unhandled exception by Yu Minecraft Launcher
ja_jp: YuMinecraft ランチャーが例外を処理していません
ru_ru: Yu Minecraft Launcher 发生未处理异常
zh_hant: Yu Minecraft Launcher 发生未处理异常

# DetailedInfo
source: Details
ja_jp: 詳細
ru_ru: 详细信息
zh_hant: 详细信息

# UnhandledErrorTip
source: Yu Minecraft Launcher encountered unhandled exceptions, may not continue to work, below for unusual details
ja_jp: YuMinecraft ランチャーで処理できない例外が発生しました。サーバを起動できないため、例外の詳細は動作しません。
ru_ru: Yu Minecraft Launcher 遇到了没有处理的异常 , 可能无法继续运行 , 下方为异常的详细信息
zh_hant: Yu Minecraft Launcher 遇到了没有处理的异常 , 可能无法继续运行 , 下方为异常的详细信息

source: Copy
ja_jp: コピー
ru_ru: 复制
zh_hant: 复制

# NoMatterErrorAndKeepOnRun
source: Ignore Error, force to continue running
ja_jp: エラーを無視して、強制し続けます
ru_ru: 忽略错误 , 强制继续运行
zh_hant: 忽略错误 , 强制继续运行

source: Exit app
ja_jp: アプリケーションを終了します。
ru_ru: 退出应用
zh_hant: 退出应用

source: Restart app
ja_jp: アプリを再起動
ru_ru: 重启应用
zh_hant: 重启应用

# LoadBackGroudFromPicFailTip
source: Failed to load background image from image file, check that image format is correct
ja_jp: 画像ファイルの背景画像ファイルの読み込みに失敗。 画像が正しい形式になっているかどうかを確認してください。
ru_ru: 从图像文件加载背景图失败 , 检查图片格式是否正确
zh_hant: 从图像文件加载背景图失败 , 检查图片格式是否正确

source: Custom Background
ja_jp: カスタム背景
ru_ru: 自定义背景
zh_hant: 自定义背景

source: Default
ja_jp: デフォルト
ru_ru: 默认
zh_hant: 默认

# BackGroundImg
source: Background Graph
ja_jp: 背景画像
ru_ru: 背景图
zh_hant: 背景图

# AcrylicBlur
source: Subsection
ja_jp: 亜克力
ru_ru: 亚克力
zh_hant: 亚克力

source: Transparent
ja_jp: アルファ
ru_ru: 透明
zh_hant: 透明
