Repository: DaiYu-233/YMCL.Avalonia
Catalog: YMCL.Main/Public/Langs/MainLang.*.resx
Languages: ja_jp, ru_ru, zh_hant

# NavLaunch
source: Launch
ja_jp: 起動
ru_ru: Активировать
zh_hant: 啟動

# NavSetting
source: Setting
ja_jp: 設定
ru_ru: Настройки
zh_hant: 設置

# NavDownload
source: Download
ja_jp: ダウンロード
ru_ru: Загрузить
zh_hant: 下載

# NavMore
source: More
ja_jp: さらに表示
ru_ru: Больше
zh_hant: 更多

# NavMusic
source: Music
ja_jp: 音楽
ru_ru: Музыка
zh_hant: 音樂

source: Launch
ja_jp: 起動
ru_ru: Активировать
zh_hant: 啟動

source: Minecraft Folder
ja_jp: Minecraft フォルダ
ru_ru: Папка Minecraft
zh_hant: Minecraft資料夾

# DelSeletedItem
source: Delete Selected
ja_jp: 選択項目を削除
ru_ru: Удалить выбранное
zh_hant: 刪除選取項目

source: Add Folder
ja_jp: フォルダを追加
ru_ru: Добавить папку
zh_hant: 新增資料夾

# SelectMinecraftFolder
source: Select the '.minecraft' folder
ja_jp: ターゲットフォルダを選択 '.minecraft'フォルダ'
ru_ru: Выберите папку'.minecraft'
zh_hant: 選擇'.minecraft'資料夾

# NeedToSelectMinecraftFolder
source: The '.minecraft' folder needs to be selected
ja_jp: ターゲットフォルダは「.minecraft'」フォルダを選択する必要があります
ru_ru: Необходимо выбрать папку'.minecraft'
zh_hant: 需選擇'.minecraft'資料夾

# SuccessAdd
source: Layouts Added Successfully
ja_jp: 追加終了
ru_ru: Успешно добавлено
zh_hant: 添加成功

# TheItemAlreadyExist
source: This item already exists
ja_jp: このプロジェクトはすでに存在します
ru_ru: Этот элемент уже существует
zh_hant: 已存在此項目

# SuccessRemove
source: Removed successfully
ja_jp: 削除成功
ru_ru: Удаление выполнено успешно
zh_hant: 刪除成功

# AutoScan
source: Automatic Scan
ja_jp: 自動スキャン
ru_ru: Автоматическое сканирование
zh_hant: 自動掃描

# LetYMCLChooseJava
source: Let YMCL choose the right Java
ja_jp: YMCLでのカスタム値 Java を利用する
ru_ru: Пусть YMCL выберет правильную Java
zh_hant: 讓YMCL選擇合適的Java

# ScanJavaSuccess
source: Scanning Java succeeded
ja_jp: Javaのスキャンが完了しました。
ru_ru: Сканирование Java выполнено успешно
zh_hant: 掃描Java成功

# RepeatItem
source: Repeating event
ja_jp: プロジェクトの複製
ru_ru: Дублировать элемент
zh_hant: 重複的項目

# NavLauncher
source: Launcher
ja_jp: ランチャー
ru_ru: Пусковая установка
zh_hant: 啟動器

# OpenFileWay
source: How to open a file
ja_jp: ファイルを開く
ru_ru: Как открыть файл
zh_hant: 開啟檔案方式

# FileSelectWindow
source: File Selection Window
ja_jp: ファイル選択ウィンドウ
ru_ru: Окно выбора файла
zh_hant: 文件選擇視窗

source: Manual input
ja_jp: 手入力
ru_ru: Введите вручную
zh_hant: 手動輸入

# Ok
source: Confirm
ja_jp: はい
ru_ru: Подтвердить
zh_hant: 確定

source: Cancel
ja_jp: キャンセル
ru_ru: Отмена
zh_hant: 取消

# InputFolderPath
source: Type the folder path
ja_jp: フォルダパスを入力
ru_ru: Введите путь к папке
zh_hant: 輸入資料夾路徑

# FolderNotExist
source: Folder does not exist
ja_jp: フォルダーが存在しません
ru_ru: Каталог не существует
zh_hant: 資料夾不存在

source: input file path
ja_jp: ファイルパスを入力
ru_ru: Введите путь к файлу
zh_hant: 輸入檔路徑

# FileNotExist
source: File does not exist
ja_jp: ファイルが存在しません
ru_ru: Файл не существует
zh_hant: 檔不存在

# ManualAdd
source: Added manually
ja_jp: 手動で追加
ru_ru: Добавить вручную
zh_hant: 手動添加

# SelectJava
source: Choose Java
ja_jp: Java の選択
ru_ru: Выбирайте Java
zh_hant: 選擇Java

# TheJavaIsError
source: Java is incorrect
ja_jp: Javaが正しくない
ru_ru: Java неверна
zh_hant: Java不正確

# NavAccount
source: Account
ja_jp: アカウント
ru_ru: Аккаунты
zh_hant: 帳戶

source: Add New Account
ja_jp: 新規アカウントを追加
ru_ru: Добавить новую учетную запись
zh_hant: 新增帳戶

# OfflineLogin
source: Log in offline
ja_jp: オフラインでログイン
ru_ru: Войти в автономном режиме
zh_hant: 離線登入

source: Microsoft Login
ja_jp: マイクロソフト ログイン
zh_hant: 微軟登入

# ThirdPartyLogin
source: The third party signin
ja_jp: サードパーティーログイン
ru_ru: Сторонний вход
zh_hant: 第三方登入

# SelectAccountType
source: Choose account type
ja_jp: アカウントの種類を選択
ru_ru: Выберите тип счета
zh_hant: 選擇帳戶類型

# AccountNameCannotBeNull
source: Account name cannot be empty
ja_jp: アカウント名が空白にはできません。
ru_ru: Имя учетной записи не может быть пустым
zh_hant: 帳戶名稱不可為空白

# InputAccountName
source: Enter Account Name
ja_jp: アカウント名を入力
ru_ru: Введите имя учетной записи
zh_hant: 輸入帳戶名稱

source: Verification code
ja_jp: 認証コード
ru_ru: Проверьте код
zh_hant: 驗證程式碼

source: Loading...
ja_jp: 読み込んでいます...
ru_ru: Загрузка...
zh_hant: 載入中...

# CopyCodeAndOPenBrowser
source: Copy the code and open your browser
ja_jp: コードをコピーしてブラウザを開く
ru_ru: Скопируйте код и откройте браузер
zh_hant: 複製程式碼並開啟瀏覽器

# WaitForMicrosoftVerification
source: Waiting for Microsoft account verification to complete Jump to the browser to complete verification
ja_jp: Microsoftアカウントの認証が完了するのを待っています ブラウザに移動して認証を完了してください
ru_ru: Ожидание подтверждения учетной записи Майкрософт Перейдите в браузер, чтобы завершить проверку
zh_hant: 正在等待微軟帳戶驗證完成 跳轉至瀏覽器完成驗證

# LoginFail
source: Login failed
ja_jp: ログインに失敗しました
ru_ru: Ошибка входа в систему
zh_hant: 登入失敗

source: Verifying account
ja_jp: アカウントを確認中
ru_ru: Подтверждение аккаунта
zh_hant: 正在驗證帳戶

# VerificationServer
source: Validation Server
ja_jp: サーバーを確認
ru_ru: Сервер аутентификации
zh_hant: 驗證伺服器

source: Email address
ja_jp: メールアドレス
ru_ru: Адрес электронной почт
zh_hant: 信箱地址

source: Account Password
ja_jp: アカウントパスワード
ru_ru: Пароль учетной записи
zh_hant: 帳戶密碼

# YggdrasilServerUrlIsEmpty
source: Verification server cannot be empty
ja_jp: 確認サーバーは空欄にできません
ru_ru: Сервер верификации не может быть пустым
zh_hant: 驗證伺服器不可為空

# YggdrasilPasswordIsEmpty
source: Password cannot be empty
ja_jp: パスワードを空白にすることはできません
ru_ru: Пароль не может быть пустым
zh_hant: 密碼不可為空

# YggdrasilEmailIsEmpty
source: Email cannot be empty
ja_jp: メールボックスは空欄にできません
ru_ru: Адрес электронной почты не может быть пустым
zh_hant: 信箱不可為空

# NavPersonalize
source: Customization
ja_jp: 個人設定
ru_ru: Персонализация
zh_hant: 個性化

source: Language
ja_jp: 言語
ru_ru: Язык
zh_hant: 語言

source: Color mode
ja_jp: カラーモード
ru_ru: Цветовой режим
zh_hant: 色彩模式

# FollowSystem
source: Follow the system
ja_jp: システムに従う
ru_ru: Следите за системой
zh_hant: 跟隨系統

source: Light
ja_jp: ライト
ru_ru: Светлый
zh_hant: 淺色

source: Dark
ja_jp: ダーク
ru_ru: Темный
zh_hant: 深色

# MaxMem
source: Maximum memory
ja_jp: 最大メモリ
ru_ru: Максимальный объем памяти
zh_hant: 最大記憶體

# CannotOpenBrowser
source: Unable to open browser
ja_jp: ブラウザを開くことができませんでした
ru_ru: Не удалось открыть браузер
zh_hant: 無法開啟瀏覽器

# ManualOpen
source: Hand Open
ja_jp: 手動で開く
ru_ru: Открыть вручную
zh_hant: 手動打開

# CopyUrlAndManualOpen
source: Ctrl + C Copy and paste the following link into your browser
ja_jp: Ctrl + C は次のリンクをコピーしブラウザーに貼り付けてください。
ru_ru: Ctrl + C Скопируйте и вставьте следующую ссылку в браузер
zh_hant: Ctrl + C 複製以下連結並貼上到瀏覽器

source: version list
ja_jp: リリース一覧
ru_ru: Список версий
zh_hant: 版本清單

# VersionSetting
source: Version Settings
ja_jp: バージョン設定
ru_ru: Настройки версии
zh_hant: 版本設定

# LaunchGame
source: Start System
ja_jp: ロード
ru_ru: Запустите игру
zh_hant: 啟動遊戲

# NoChooseGame
source: No game selected
ja_jp: ゲームが選択されていません
ru_ru: Игра не выбрана
zh_hant: 未選擇遊戲

# ReturnWithIcon
source: ← Go back
ja_jp: ← 戻す
ru_ru: ← Назад
zh_hant: 返回

# CreateGameEntryFail
source: Failed to create game instance
ja_jp: ゲームインスタンスの作成に失敗しました
ru_ru: Не удалось создать экземпляр игры
zh_hant: 創建遊戲實例失敗

# NoChooseGameOrCannotFindGame
source: No game selected or could not be found
ja_jp: ゲームが選択されていないか、ゲームが見つかりませんでした.
ru_ru: Игра не выбрана или не может быть найдена
zh_hant: 未選擇遊戲或無法找到遊戲

source: Account Error
ja_jp: アカウントエラー
ru_ru: Ошибка аккаунта
zh_hant: 帳戶錯誤

# LaunchProgress
source: Startup
ja_jp: プログレスを起動
ru_ru: Прогресс запуска
zh_hant: 啟動進度

# BuildLaunchConfigFail
source: Failed to build startup configuration
ja_jp: 構成のビルド開始に失敗しました
ru_ru: Не удалось создать конфигурацию запуска
zh_hant: 建置啟動配置失敗

source: Game exited
ja_jp: ゲームが終了しました
ru_ru: Игра завершена
zh_hant: 遊戲已退出

# WaitForGameWindowAppear
source: Wait for the game window to appear
ja_jp: ゲームウィンドウ接近を待機中
ru_ru: Дождитесь появления игрового окна
zh_hant: 等待遊戲視窗出現

# LaunchFinish
source: Startup complete
ja_jp: 開始終了
ru_ru: Запуск завершен
zh_hant: 啟動完成

# LaunchFail
source: Start failure
ja_jp: 起動に失敗しました
ru_ru: удаление% 1 завершилось неудачно
zh_hant: 啟動失敗

source: User Data Folder
ja_jp: ユーザー データ フォルダ
ru_ru: Папка данных пользователя
zh_hant: 使用者資料夾

source: Open Folder
ja_jp: フォルダを開く
ru_ru: Открыть папку
zh_hant: 打開資料夾

# AutoInstall
source: Automated Installation
ja_jp: 自動インストール
ru_ru: Автоматическая установка
zh_hant: 自動安裝

source: Latest Version
ja_jp: 最新バージョン
ru_ru: Последняя версия
zh_hant: 最新版本

# PreviewVersion
source: Pre release version
ja_jp: バージョンをプレビュー
ru_ru: Предварительная версия
zh_hant: 預覽版本

source: Release version
ja_jp: リリースチャンネル
ru_ru: Официальный релиз
zh_hant: 正式版本

# GetInstallableVersionFail
source: Failed to get installable list
ja_jp: インストールできるリストの取得に失敗しました
ru_ru: Не удалось получить список для установки
zh_hant: 取得可安裝清單失敗

# OldVersion
source: Ancient Version
ja_jp: 古いバージョン
ru_ru: Древняя версия
zh_hant: 遠古版

# AllVersion
source: All Builds
ja_jp: 全てのバージョン
ru_ru: Все версии
zh_hant: 所有版本

# SearchKeyword
source: Keywords Search...
ja_jp: 検索キーワード...
ru_ru: Поиск по ключевым словам...
zh_hant: 搜尋關鍵字...

source: Install Preview
ja_jp: インストールのプレビュー
ru_ru: Установите предварительный просмотр
zh_hant: 安裝預覽

# NoAdditionalInstall
source: No additional installation
ja_jp: 空のインストール
ru_ru: Никакой дополнительной установки
zh_hant: 無附加安裝

# BeginInstall
source: Start Install
ja_jp: インストールの開始
ru_ru: Начать установку
zh_hant: 開始安裝

# ViewUpdatedContent
source: What's New
ja_jp: 更新を見る
ru_ru: Посмотрите, что нового
zh_hant: 查看更新內容

# Reload
source: Reloading
ja_jp: 再読み込み
ru_ru: Перезагрузить
zh_hant: 重新加載

# GetFail
source: Access failed
ja_jp: フェッチに失敗しました
ru_ru: Не удалось получить
zh_hant: 取得失敗

# NoAvailableItem
source: no available items
ja_jp: 利用可能なプロジェクトがありません
ru_ru: Нет доступных товаров
zh_hant: 無可用項目

# MineratCrashed
source: Minecrat crashed
ja_jp: Minecratrでクラッシュしました
ru_ru: Минекрат разбился
zh_hant: Minecrat發生崩潰

# TheVersionNameWillBeRenamedTo
source: Version name will be renamed to:
ja_jp: バージョン名が変更されます:
ru_ru: Название версии будет переименовано в:
zh_hant: 版本名稱將被重新命名為:

# IncludeSpecialWord
source: Contains Special Characters
ja_jp: 特殊文字が含まれています
ru_ru: Содержит специальных персонажей
zh_hant: 包含特殊字元

source: Folder already exists
ja_jp: フォルダは既に存在します
ru_ru: Папка уже существует
zh_hant: 資料夾已存在

# InstallFail
source: Installation failled
ja_jp: インストールに失敗しました
ru_ru: Ошибка установки
zh_hant: 安裝失敗

# Install
source: Installation
ja_jp: インストール
ru_ru: Установка
zh_hant: 安裝

# InstallFinish
source: Installation finished
ja_jp: インストール完了
ru_ru: Установка завершена
zh_hant: 安裝完成

# CannotFandRightJava
source: Couldn't find the right Java
ja_jp: 該当するJavaは見つかりませんでした
ru_ru: Не удалось найти нужную Java
zh_hant: 無法找到合適Java

source: Refresh
ja_jp: 更新
ru_ru: Обновить
zh_hant: 刷新

# Mod
source: Module
ja_jp: モジュール
ru_ru: Моды
zh_hant: 模組

source: Overview
ja_jp: 概要
ru_ru: Обзор
zh_hant: 概述

# Setting
source: Settings
ja_jp: 設定
ru_ru: Настройки
zh_hant: 設置

# SavesFolder
source: Archive Folder
ja_jp: アーカイブフォルダ
ru_ru: Архивировать папку
zh_hant: 存檔資料夾

# ModsFolder
source: Module Folder
ja_jp: MODフォルダー
ru_ru: Папка модуля
zh_hant: 模組資料夾

# ResourcepacksFolder
source: Resource Pack Folder
ja_jp: リソース パック フォルダ
ru_ru: Папка пакета ресурсов
zh_hant: 資源包資料夾

# ShaderpacksFolder
source: Light Pack Folder
ja_jp: 影パッケージフォルダ
ru_ru: Папка Light Pack
zh_hant: 光影包資料夾

source: Version Folder
ja_jp: バージョンフォルダ
ru_ru: Папка версий
zh_hant: 版本資料夾

# EnableIndependencyCore
source: Enable standalone cores
ja_jp: スタンドアロンコアを有効化
ru_ru: Включите автономные ядра
zh_hant: 啟用獨立核心

# UseGlobalSetting
source: Use Global settings
ja_jp: グローバル設定を使用
ru_ru: Использовать общие настройки
zh_hant: 使用全域設定

source: Off
ja_jp: 閉じる
ru_ru: закрыть
zh_hant: 關閉

source: On
ja_jp: オン
ru_ru: включать
zh_hant: 開啟

# AutoJoinServer
source: Automatically join the server
ja_jp: サーバーを自動登録
ru_ru: Автоматически присоединяться к серверу
zh_hant: 自動加入伺服器

# EnableSelect
source: Enable Checked
ja_jp: 選択を有効
ru_ru: Включить Проверено
zh_hant: 啟用選取項目

# DisableSelect
source: Disable Selected
ja_jp: 選択項目の無効化
ru_ru: Отключить выбранное
zh_hant: 停用選取項目

# DeleteSelect
source: Delete Selected
ja_jp: 選択項目を削除
ru_ru: Удалить выбранное
zh_hant: 刪除選取項目

source: Select All
ja_jp: すべて選択
ru_ru: Выбрать всё
zh_hant: 全選

source: Deselect all
ja_jp: 選択を解除
ru_ru: Не выбирайте ни одного
zh_hant: 全不選

# SelectedItem
source: Selected items:
ja_jp: 選択された項目:
ru_ru: Выбранные элементы:
zh_hant: 已選擇項目:

# MoveToRecycleBin
source: Move to trash
ja_jp: ゴミ箱に移動
ru_ru: Переместить в корзину
zh_hant: 移動到回收站

source: Window title bar style
ja_jp: ウインドウのタイトルバーのスタイル
ru_ru: Стиль строки заголовка окна
zh_hant: 視窗標題欄樣式

# GetException
source: An exception occurs
ja_jp: 例外が発生しました
ru_ru: Что-то пошло не так
zh_hant: 發生異常

source: Unhandled exception
ja_jp: 未処理例外:
ru_ru: Необработанное исключение
zh_hant: 未處理的異常

source: Custom Home Page
ja_jp: メインページ
ru_ru: Настройте главную страницу
zh_hant: 自訂主頁面

source: Local source code
ja_jp: ローカルソースコード
ru_ru: Локальный исходный код
zh_hant: 本地原始碼

source: Edit
ja_jp: 編集
ru_ru: Редактировать
zh_hant: 編輯

# CustomHomePageSourceCodeError
source: Custom main page source code error
ja_jp: メインページのソースの編集エラー
ru_ru: Ошибка исходного кода пользовательской главной страницы
zh_hant: 自訂主頁面原始碼錯誤

# CheckUpdate
source: Check for updates
ja_jp: 更新を確認
ru_ru: Проверить обновления
zh_hant: 檢查更新

# ChooseArchitecture
source: Select platform
ja_jp: プラットフォームを選ぶ
ru_ru: Выберите площадку
zh_hant: 選擇平台

# CheckUpdateFail
source: Unable to check for updates
ja_jp: 更新のチェックに失敗しました
ru_ru: Не удалось проверить наличие обновлений
zh_hant: 檢查更新失敗

# FoundNewVersion
source: Detect a newer version
ja_jp: 新しいバージョンが利用可能
ru_ru: Откройте для себя новые версии
zh_hant: 發現新版本

# GetUpdateUrl
source: Get Updated Uniform Resource Locator
ja_jp: 統一リソースの位置を更新
ru_ru: Получите обновленный унифицированный локатор ресурсов
zh_hant: 取得更新統一資源定位器

# BeginDownload
source: Start Download
ja_jp: ダウンロードを開始中
ru_ru: Начать загрузку
zh_hant: 開始下載

# UpdateFail
source: Update Failed
ja_jp: 更新に失敗しました
ru_ru: Ошибка обновления
zh_hant: 更新失敗

# ThisArchitectureCannotAutoUpdate
source: This platform does not support automatic updates, open the following path to manually replace it
ja_jp: このプラットフォームは自動的に更新されません。次のパスを手動で置き換えてください
ru_ru: Эта платформа не поддерживает автоматические обновления, откройте следующий путь, чтобы заменить ее вручную
zh_hant: 此平台不支援自動更新，開啟以下路徑手動替換

# Update
source: Updated
ja_jp: アップデート
ru_ru: Обновить
zh_hant: 更新

# DownloadFinish
source: Download completed
ja_jp: ダウンロード完了
ru_ru: Загрузка завершена
zh_hant: 下載完成

# CurrentlyTheLatestVersion
source: The current version is up to date
ja_jp: お使いのバージョンは最新です。
ru_ru: Текущая версия обновлена
zh_hant: 目前是最新版本

# OpenSourceProjectUsageTable
source: Open Source Project Usage Sheet
ja_jp: オープンソースプロジェクト用テーブル
ru_ru: Лист использования проекта с открытым исходным кодом
zh_hant: 開源項目使用表

# GPL3Text
source: The YMCL is open source under the Apache License and may be modified and distributed, but the software must contain the copyright and license notices for the original code, as well as a notification file containing the license information.
ja_jp: YMCLは Apache License プロトコルのソースコードとしてオープンソース化できますが、ライセンスキーの登録およびライセンス規約を含める必要があります。また、ライセンス情報含む通知ファイルが必要です。
ru_ru: Лицензия YMCL является открытым исходным кодом по лицензии Apache и может быть изменена и распространена, но программное обеспечение должно содержать уведомления об авторских правах и лицензиях для исходного кода, а также файл уведомлений, содержащий информацию о лицензии.
zh_hant: YMCL 以GPL-3.0 協議開放原始碼，可以修改且分發，但不得刪除原作品的標記，修改後的作品必須也採用GPL 協定進行開源。

source: Show Game Output
ja_jp: ゲームエクスポートを表示
ru_ru: Показать результат игры
zh_hant: 顯示遊戲輸出

source: Search
ja_jp: 検索
ru_ru: поиск
zh_hant: 搜尋

source: Load More
ja_jp: もっと表示
ru_ru: Загрузи больше
zh_hant: 載入更多

source: Error calling Api
ja_jp: API 呼び出し時にエラー
ru_ru: Ошибка при вызове Api
zh_hant: 呼叫Api時發生錯誤

# SearchNoResult
source: No result found
ja_jp: 結果が見つかりませんでした
ru_ru: Нет результатов для поиска
zh_hant: 搜尋無結果

# AddLocalSong
source: Add Audio File
ja_jp: 音声ファイルを追加
ru_ru: Добавьте аудиофайлы
zh_hant: 新增音訊檔案

# SelectMusicFile
source: Choose an Audio File
ja_jp: オーディオファイルを選択してください
ru_ru: Выберите аудиофайл
zh_hant: 選擇音訊檔案

source: Theme color
ja_jp: アクセント色
ru_ru: Цвет темы
zh_hant: 主題色

# InitAudioLibraryFail
source: Failed to initialize audio library
ja_jp: オーディオライブラリの初期化に失敗しました
ru_ru: Не удалось инициализировать аудио библиотеку
zh_hant: 初始化音訊庫失敗

# InstallVlcTip
source: Attempt to execute: sudo apt install libvlc-dev sudo apt install vlc
ja_jp: 実行を試みます： sudo apt install libvlc - dev sudo apt install vlc
ru_ru: Попытка выполнения: sudo apt install libvlc-dev sudo apt install vlc
zh_hant: 嘗試執行: sudo apt install libvlc-dev sudo apt install vlc

# ThisFeatureIsCurrentlyUnderDevelopment
source: This feature is in development
ja_jp: この機能は現在開発中です
ru_ru: Эта функция находится в разработке
zh_hant: 此功能正在開發中

# TreasureBox
source: Treasure chest
ja_jp: 百箱
ru_ru: Сундук с сокровищами
zh_hant: 百寶箱

# ActivateWinOffice
source: Activate Windows/Office
ja_jp: Windows/Office の利用
ru_ru: Активируйте Windows/Office
zh_hant: 激活Windows/Office

source: Run
ja_jp: 実行
ru_ru: Работа
zh_hant: 運行

# ThisFeatureOnlySupportsWindowsPlatform
source: This feature is only available on Windows
ja_jp: この機能はWindowsプラットフォームでのみサポートされています。
ru_ru: Эта функция доступна только в Windows
zh_hant: 此功能僅支援Windows平台

# RunCommandFail
source: Failed to run command
ja_jp: コマンドを実行できません
ru_ru: Не удалось запустить команду
zh_hant: 運行命令失敗

# RunActivate
source: Run activation
ja_jp: アクティベート
ru_ru: Запустите активацию
zh_hant: 運行激活

# CancelActivateWin
source: Deactivate Windows
ja_jp: Windows の有効化をキャンセル
ru_ru: Деактивируйте Windows
zh_hant: 取消激活Windows

# CancelActivateWinTip
source: This action will remove Windows activation status, making features such as Windows personalization unavailable. Do you want to continue?
ja_jp: Windowsの有効化状態を削除し、Windows パーソナライゼーション機能では使用できません。続行しますか。
ru_ru: Это действие удалит состояние активации Windows, сделав недоступными такие функции, как персонализация Windows. Продолжить?
zh_hant: 此操作會移除Windows啟動狀態，導致Windows個人化等功能無法使用，是否繼續？

# ThisFeatureOnlySupportsWindows10AndAbove
source: This feature only supports Windows 10 and above, and systems below this version are not guaranteed to be activated successfully
ja_jp: この機能はWindows10以降でのみサポートされています。最新のバージョンでは有効にする必要があります。
ru_ru: Эта функция поддерживает только Windows 10 и выше, и системы ниже этой версии не гарантируют успешной активации
zh_hant: 此功能僅支援Windows10以上，低於此版本系統不保證啟動成功

source: Playlist
ja_jp: プレイリスト
ru_ru: Воспроизвести список
zh_hant: 播放清單

# ModName
source: Module name
ja_jp: MOD名
ru_ru: Название модуля
zh_hant: 模組名稱

source: Game version
ja_jp: ゲームバージョン
ru_ru: Версия игры
zh_hant: 遊戲版本

# AnyModLoader
source: Any loader
ja_jp: 任意のローダー
ru_ru: Любой погрузчик
zh_hant: 任意載入器

# AnySource
source: All sources
ja_jp: すべてのソース
ru_ru: Все источники
zh_hant: 所有來源

source: Download
ja_jp: ダウンロード
ru_ru: Загрузить
zh_hant: 下載

# SaveFile
source: Save the file
ja_jp: ファイルを保存
ru_ru: Сохранить
zh_hant: 保存檔案

# DownloadFail
source: Download failed
ja_jp: ダウンロードに失敗しました
ru_ru: Загрузка не удалась
zh_hant: 下載失敗

source: Matching version
ja_jp: 一致するバージョン
ru_ru: Соответствующая версия
zh_hant: 匹配的版本

# ModifyMicrosoftSkin
source: Modify Skin (Microsoft)
ja_jp: スキン変更 (Microsoft)
ru_ru: Microsoft
zh_hant: 修改皮膚(微軟)

source: Skin model
ja_jp: 皮膚モデル
ru_ru: Модель кожи
zh_hant: 皮膚模型

# InputSkinFilePath
source: Enter skin file path
ja_jp: スキンファイルパスを入力...
ru_ru: Введите путь к файлу скина
zh_hant: 輸入皮膚檔路徑

source: Select skin file
ja_jp: スキンファイルを選択
ru_ru: Выберите файл скина
zh_hant: 選擇皮膚檔案

# RefreshMicrosoftSkin
source: Refresh Skin (Microsoft)
ja_jp: ウィンドウを更新 (Microsoft)
ru_ru: Microsoft
zh_hant: 刷新皮膚(微軟)

# ModifySuccess
source: modified
ja_jp: 修正終了
ru_ru: Модификация прошла успешно
zh_hant: 修改成功

# ModifyFail
source: Modify failed
ja_jp: 更新に失敗しました
ru_ru: Ошибка изменения
zh_hant: 修改失敗

# IfInstallBedRock
source: If the bedrock version is not installed, it will not start
ja_jp: Blect がインストールされていない場合は起動できません。
ru_ru: Если версия коренной породы не установлена, она не запустится
zh_hant: 如未安裝基岩版則無法啟動

# BedRockVersion
source: Bedrock Edition
ja_jp: BE版 バージョン
zh_hant: 基岩版

# CannotOpenBedRockSetting
source: Could not open bedrock settings
ja_jp: ベースロック設定を開けませんでした
ru_ru: Не удалось открыть настройки коренной породы
zh_hant: 無法打開基岩版設定

# UpgradeToAdministratorPrivileges
source: Upgrade to Admin Permissions
ja_jp: 管理者の権限を上げる
ru_ru: Обновите до прав администратора
zh_hant: 提升至管理員權限

# UpgradeToAdministratorPrivilegesFail
source: Failed to upgrade to admin permissions
ja_jp: 管理者への昇格が失敗しました
ru_ru: Не удалось обновить права администратора
zh_hant: 提升至管理員權限失敗

# UpgradeToAdministratorPrivilegesTip
source: To perform the operation, you need to upgrade to administrator privileges. Click OK to restart the program with administrator privileges
ja_jp: 操作を実行するために管理者権限が必要です。OKを押すとアプリケーションを再起動します。
ru_ru: Для выполнения операции необходимо обновить права администратора. Нажмите кнопку ОК, чтобы перезапустить программу с правами администратора
zh_hant: 執行操作需要提升至管理員權限，點選確定以管理員權限重新啟動程式

# ChooseLanguage
source: Choose language/language
ja_jp: 言語/Choose Language を選択してください
ru_ru: 选择语言/Choose Language
zh_hant: 选择语言/Choose Language

# ReleaseTheMouseAndLetYmclProcessThisFile
source: Release the mouse to let YMCL process this file
ja_jp: YMCLを使用してこのファイルを処理するマウス
ru_ru: Отпустите мышь, чтобы YMCL обработал этот файл
zh_hant: 釋放滑鼠讓YMCL處理此檔案

# UnableToAddModsForBedrockEdition
source: Modules cannot be added to the Bedrock Edition
ja_jp: Modを作成できませんでした
ru_ru: Модули не могут быть добавлены в Bedrock Edition
zh_hant: 無法為基岩版添加模組

# AddTheFollowingFilesAsModsToTheCurrentVersion
source: Add the following files as a module to the current version
ja_jp: 以下のファイルをMODとして追加
ru_ru: Добавьте следующие файлы в качестве модуля в текущую версию
zh_hant: 將以下文件作為模組新增至目前版本

# UnsupportedFileType
source: File type not supported
ja_jp: 対応していないファイルタイプです。
ru_ru: Неподдерживаемый тип файла
zh_hant: 不支援的文件類型

source: Install the following files as an integration package (CurseForge format)
ja_jp: 以下のファイルを統合パッケージ（ CurseForge形式）としてインストールしてください
ru_ru: Установите следующие файлы в качестве пакета интеграции (формат CurseForge)
zh_hant: 將下列檔案作為整合包(CurseForge格式)安裝

source: Unzip
ja_jp: 解凍
ru_ru: Распакуйте
zh_hant: 解壓

# UnzipingModPack
source: Unpacking the Integration Pack
ja_jp: Modパックを展開中
ru_ru: Распаковка интеграционного пакета
zh_hant: 正在解壓縮整合包

# FinsihUnzipModPack
source: Unpacking Integration Pack complete
ja_jp: 統合されたパックの解凍が完了しました。
ru_ru: Распаковка интеграционного пакета завершена
zh_hant: 解壓縮整合包完成

# GetModPackInfo
source: Get the Integration Pack Info
ja_jp: Modパック情報の取得
ru_ru: Получите информацию о пакете интеграции
zh_hant: 取得整合包資訊

# ModPackInfo
source: Integrate package information
ja_jp: バンドル情報
ru_ru: Интегрируйте информацию о пакете
zh_hant: 整合包資訊

# ImportFailed
source: Import Fail
ja_jp: インポートできません
ru_ru: Импорт не удался
zh_hant: 導入失敗

# ImportSuccess
source: The tapes for indexing are imported successfully
ja_jp: インポート成功
ru_ru: Импорт выполнен успешно
zh_hant: 導入成功

# NoCrashInfo
source: No crash information
ja_jp: クラッシュ情報はありません
ru_ru: Нет информации о ДТП
zh_hant: 無崩潰訊息

# DownloadModPackMod
source: Download the Integration Pack Module
ja_jp: ModとModをダウンロード
ru_ru: Загрузите модуль Интеграционного пакета
zh_hant: 下載整合包模組

# TotalNumberOfMod
source: Total number of modules
ja_jp: MOD合計
ru_ru: Общее количество модулей
zh_hant: 模組總數量

# DownloadSuccess
source: Downloaded successfully
ja_jp: ダウンロードに成功しました
ru_ru: Загрузка выполнена успешно
zh_hant: 下載成功

# OverrideModPack
source: Override the Integration Pack
ja_jp: Modパック
ru_ru: Переопределите интеграционный пакет
zh_hant: 覆蓋整合包

# DownloadFailedFileAgain
source: Failed to re-download file
ja_jp: 失敗したファイルの再ダウンロード中...
ru_ru: Не удалось повторно загрузить файл
zh_hant: 重新下載失敗檔

# Plugin
source: Plugins
ja_jp: プラグイン
ru_ru: Плагины
zh_hant: 外掛程式
